
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>第一章 - 基本概念 · The Little Go Book 繁體中文翻譯版</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.0">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter2.html" />
    
    
    <link rel="prev" href="getting-started.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="about.html">
            
                <a href="about.html">
            
                    
                    關於本書
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    簡介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="getting-started.html">
            
                <a href="getting-started.html">
            
                    
                    入門
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章 - 基本概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章 - 結構
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章 - Map、Array、和 Slice
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章 - 組織程式碼和介面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章 - 花絮
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章 - 並行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    結論
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章 - 基本概念</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E00;&#x7AE0;---&#x57FA;&#x672C;&#x6982;&#x5FF5;">&#x7B2C;&#x4E00;&#x7AE0; - &#x57FA;&#x672C;&#x6982;&#x5FF5;</h1><p>Go &#x662F;&#x9700;&#x8981;&#x7DE8;&#x8B6F;&#x3001;&#x975C;&#x614B;&#x578B;&#x5225;&#x3001;&#x5177;&#x6709;&#x985E;&#x4F3C;&#x65BC; C &#x7684;&#x8A9E;&#x6CD5;&#x8207;&#x64C1;&#x6709; Garbage Collection &#x7B49;&#x7279;&#x6027;&#x7684;&#x8A9E;&#x8A00;&#x3002;
&#x9019;&#x662F;&#x4EC0;&#x9EBC;&#x610F;&#x601D;&#xFF1F;</p><h2 id="&#x7DE8;&#x8B6F;">&#x7DE8;&#x8B6F;</h2><p>&#x7DE8;&#x8B6F;&#x662F;&#x5C07;&#x9AD8;&#x968E;&#x7A0B;&#x5F0F;&#x78BC;&#x8F49;&#x63DB;&#x70BA;&#x4F4E;&#x968E;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x904E;&#x7A0B;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x5728; Go &#x4F86;&#x8AAA;&#x5C31;&#x6703;&#x662F;&#x7D44;&#x5408;&#x8A9E;&#x8A00;&#xFF0C;&#x6216;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x4E2D;&#x4ECB;&#x8A9E;&#x8A00;&#xFF08;&#x6BD4;&#x5982;&#x8AAA; Java &#x548C; C#&#xFF09;</p><p>&#x4F60;&#x53EF;&#x80FD;&#x89BA;&#x5F97;&#x7DE8;&#x8B6F;&#x8A9E;&#x8A00;&#x8B93;&#x4F60;&#x611F;&#x5230;&#x4E0D;&#x6109;&#x5FEB;&#xFF0C;&#x56E0;&#x70BA;&#x7DE8;&#x8B6F;&#x901F;&#x5EA6;&#x53EF;&#x80FD;&#x76F8;&#x5C0D;&#x6162;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x6578;&#x5206;&#x9418;&#x751A;&#x81F3;&#x6578;&#x5C0F;&#x6642;&#x4F86;&#x7DE8;&#x8B6F;&#x4F60;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x90A3;&#x8981;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x662F;&#x76F8;&#x7576;&#x56F0;&#x96E3;&#x7684;&#x3002;&#x7DE8;&#x8B6F;&#x901F;&#x5EA6;&#x662F; Go &#x8A9E;&#x8A00;&#x5728;&#x8A2D;&#x8A08;&#x4E0A;&#x7684;&#x4E3B;&#x8981;&#x8003;&#x91CF;&#x3002;&#x9019;&#x5C0D;&#x65BC;&#x904E;&#x53BB;&#x4F7F;&#x7528;&#x76F4;&#x8B6F;&#x5F0F;&#x8A9E;&#x8A00;&#x4E26;&#x4E14;&#x5F97;&#x5229;&#x65BC;&#x5FEB;&#x901F;&#x958B;&#x767C;&#x9031;&#x671F;&#x7684;&#x4EBA;&#x4F86;&#x8AAA;&#xFF0C;&#x662F;&#x76F8;&#x7576;&#x597D;&#x7684;&#x6D88;&#x606F;&#x3002;</p><p>&#x7DE8;&#x8B6F;&#x8A9E;&#x8A00;&#x7684;&#x57F7;&#x884C;&#x901F;&#x5EA6;&#x8F03;&#x5FEB;&#xFF0C;&#x800C;&#x4E14;&#x57F7;&#x884C;&#x6642;&#x4E0D;&#x9700;&#x8981;&#x984D;&#x5916;&#x7684;&#x76F8;&#x4F9D;&#x5957;&#x4EF6;&#xFF08;&#x81F3;&#x5C11;&#xFF0C;&#x9019;&#x5C0D;&#x65BC; C&#x3001;C++ &#x548C; Go &#x9019;&#x985E;&#x7DE8;&#x8B6F;&#x6210;&#x7D44;&#x5408;&#x8A9E;&#x8A00;&#x7684;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x4F86;&#x8AAA;&#x662F;&#x9019;&#x6A23;&#x7684;&#xFF09;&#x3002;</p><h2 id="&#x975C;&#x614B;&#x578B;&#x5225;">&#x975C;&#x614B;&#x578B;&#x5225;</h2><p>&#x975C;&#x614B;&#x578B;&#x5225;&#x610F;&#x5473;&#x8457;&#x8B8A;&#x6578;&#x5FC5;&#x9808;&#x662F;&#x7279;&#x5B9A;&#x985E;&#x578B;&#xFF08;int&#x3001;string&#x3001;bool&#x3001;[]byte &#x7B49;&#xFF09;&#x3002;
&#x9019;&#x53EF;&#x4EE5;&#x900F;&#x904E;&#x5728;&#x5BA3;&#x544A;&#x8B8A;&#x6578;&#x6642;&#x6307;&#x5B9A;&#x985E;&#x578B;&#x4F86;&#x5BE6;&#x73FE;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x8A31;&#x591A;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x8B93;&#x7DE8;&#x8B6F;&#x5668;&#x4F86;&#x5E6B;&#x52A9;&#x4F60;&#x63A8;&#x65B7;&#x985E;&#x578B;
&#xFF08;&#x6211;&#x5011;&#x7A0D;&#x5F8C;&#x5C07;&#x770B;&#x770B;&#x7BC4;&#x4F8B;&#xFF09;&#x3002;&#x95DC;&#x65BC;&#x975C;&#x614B;&#x578B;&#x5225;&#x6709;&#x5F88;&#x591A;&#x53EF;&#x4EE5;&#x63D0;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x76F8;&#x4FE1;&#x900F;&#x904E;&#x95B1;&#x8B80;&#x7A0B;&#x5F0F;&#x78BC;&#x4F60;&#x6703;&#x6709;&#x66F4;&#x597D;&#x7684;&#x7406;&#x89E3;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7FD2;&#x6163;&#x65BC;&#x52D5;&#x614B;&#x985E;&#x578B;&#x7684;&#x8A9E;&#x8A00;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x767C;&#x73FE;&#x9019;&#x5F88;&#x9EBB;&#x7169;&#x3002;&#x6C92;&#x6709;&#x932F;&#xFF0C;&#x4F46;&#x9019;&#x662F;&#x6709;&#x597D;&#x8655;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x975C;&#x614B;&#x578B;&#x5225;&#x7CFB;&#x7D71;&#xFF0C;&#x7DE8;&#x8B6F;&#x5668;&#x9664;&#x4E86;&#x80FD;&#x5920;&#x6AA2;&#x67E5;&#x8A9E;&#x6CD5;&#x932F;&#x8AA4;&#x5916;&#xFF0C;&#x4E26;&#x80FD;&#x9032;&#x4E00;&#x6B65;&#x9032;&#x884C;&#x512A;&#x5316;&#x3002;</p><h2 id="&#x985E;&#x4F3C;&#x65BC;-c-&#x7684;&#x8A9E;&#x6CD5;">&#x985E;&#x4F3C;&#x65BC; C &#x7684;&#x8A9E;&#x6CD5;</h2><p>&#x5982;&#x679C;&#x4E00;&#x500B;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x7684;&#x8A9E;&#x6CD5;&#x985E;&#x4F3C;&#x65BC; C&#xFF0C;&#x4E26;&#x4E14;&#x4F60;&#x66FE;&#x7D93;&#x4F7F;&#x7528;&#x904E;&#x5176;&#x4ED6;&#x985E;&#x4F3C;&#x8A9E;&#x6CD5;&#x7684;&#x8A9E;&#x8A00;&#xFF0C;
&#x4F8B;&#x5982;&#xFF1A;C&#x3001;C++&#x3001;Java&#x3001;Javascript &#x548C; C#&#xFF0C;&#x90A3;&#x4F60;&#x6703;&#x767C;&#x73FE; Go &#x81F3;&#x5C11;&#x8868;&#x9762;&#x4E0A;&#x770B;&#x8D77;&#x4F86;&#x5F88;&#x985E;&#x4F3C;&#x3002;&#x6BD4;&#x5982;&#x8AAA;&#xFF0C;&#x9019;&#x4EE3;&#x8868;&#x4E86; <code>&amp;&amp;</code> &#x662F; boolean &#x7684; AND&#x3001;<code>==</code> &#x662F;&#x7528;&#x4F86;&#x6BD4;&#x8F03;&#x662F;&#x5426;&#x76F8;&#x7B49;&#x3001;<code>{</code> &#x548C; <code>}</code>
&#x662F;&#x4E00;&#x500B;&#x5BA3;&#x544A;&#x7684;&#x7BC4;&#x570D;&#xFF0C;&#x4EE5;&#x53CA;&#x9663;&#x5217;&#x7684; index &#x5F9E; 0 &#x958B;&#x59CB;&#x3002;</p><p>&#x985E;&#x4F3C;&#x65BC; C &#x7684;&#x8A9E;&#x6CD5;&#x4E5F;&#x4EE3;&#x8868;&#x4E86;&#xFF0C;&#x5206;&#x865F;&#x6307;&#x7684;&#x662F;&#x4E00;&#x884C;&#x7684;&#x7D50;&#x675F;&#xFF0C;&#x4EE5;&#x53CA;&#x7528;&#x62EC;&#x865F;&#x4F86;&#x5305;&#x4F4F;&#x689D;&#x4EF6;&#x3002;&#x4F46;&#x5728; Go &#x8A9E;&#x8A00;&#x4E2D;&#x7701;&#x53BB;&#x4E86;&#x9019;&#x5169;&#x500B;&#x90E8;&#x5206;&#xFF0C;
&#x5118;&#x7BA1;&#x5927;&#x62EC;&#x865F;&#x9084;&#x662F;&#x7528;&#x5728;&#x63A7;&#x5236;&#x7BC4;&#x570D;&#x3002;&#x8209;&#x4F8B;&#x4F86;&#x8AAA;&#xFF0C;&#x4E00;&#x500B; if &#x689D;&#x4EF6;&#x5F0F;&#x6703;&#x9577;&#x7684;&#x50CF;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">if</span> name == <span class="hljs-string">&quot;Leto&quot;</span> {
  <span class="hljs-built_in">print</span>(<span class="hljs-string">&quot;the spice must flow&quot;</span>)
}</code></pre>
<p>&#x4E00;&#x500B;&#x66F4;&#x8907;&#x96DC;&#x4E00;&#x9EDE;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x62EC;&#x865F;&#x4F9D;&#x820A;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">if</span> (name == <span class="hljs-string">&quot;Goku&quot;</span> &amp;&amp; power &gt; <span class="hljs-number">9000</span>) || (name == <span class="hljs-string">&quot;gohan&quot;</span> &amp;&amp; power &lt; <span class="hljs-number">4000</span>)  {
  <span class="hljs-built_in">print</span>(<span class="hljs-string">&quot;super Saiyan&quot;</span>)
}</code></pre>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;Go &#x6BD4; C&#xFF03; &#x6216; Java &#x66F4;&#x63A5;&#x8FD1; C - &#x4E0D;&#x50C5;&#x5728;&#x8A9E;&#x6CD5;&#x4E0A;&#xFF0C;&#x66F4;&#x5728;&#x65BC;&#x5176;&#x76EE;&#x7684;&#x3002;&#x7576;&#x4F60;&#x53BB;&#x5B78;&#x7FD2; Go &#x8A9E;&#x8A00;&#x5F8C;&#xFF0C;&#x4F60;&#x6703;&#x767C;&#x73FE;&#x5B83;&#x7684;&#x7C21;&#x6F54;&#x548C;&#x7C21;&#x55AE;&#x3002;</p><h2 id="garbage-collected">Garbage Collected</h2><p>&#x4E00;&#x4E9B;&#x8B8A;&#x6578;&#x5728;&#x5EFA;&#x7ACB;&#x6642;&#xFF0C;&#x6709;&#x4E00;&#x500B;&#x5BB9;&#x6613;&#x5B9A;&#x7FA9;&#x7684;&#x751F;&#x547D;&#x9031;&#x671F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x51FD;&#x5F0F;&#x7684;&#x5340;&#x57DF;&#x8B8A;&#x6578;&#x5728;&#x51FD;&#x5F0F;&#x7D50;&#x675F;&#x6642;&#x6D88;&#x5931;&#x3002;&#x5728;&#x5176;&#x4ED6;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x9019;&#x4E0D;&#x662F;&#x90A3;&#x9EBC;&#x986F;&#x8457; - &#x81F3;&#x5C11;&#x5C0D;&#x65BC;&#x7DE8;&#x8B6F;&#x5668;&#x4F86;&#x8AAA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x51FD;&#x5F0F;&#x8FD4;&#x56DE;&#x6216;&#x7531;&#x5176;&#x4ED6;&#x8B8A;&#x6578;&#x548C;&#x7269;&#x4EF6;&#x5F15;&#x7528;&#x7684;&#x8B8A;&#x6578;&#x751F;&#x547D;&#x9031;&#x671F;&#x53EF;&#x80FD;&#x96E3;&#x4EE5;&#x78BA;&#x5B9A;&#x3002;&#x6C92;&#x6709; garbage collection &#x6A5F;&#x5236;&#xFF0C;&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x9700;&#x8981;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x8B8A;&#x6578;&#x7684;&#x6642;&#x5019;&#x91CB;&#x653E;&#x8207;&#x9019;&#x4E9B;&#x8B8A;&#x6578;&#x76F8;&#x95DC;&#x7684;&#x8A18;&#x61B6;&#x9AD4;&#x3002;&#x600E;&#x9EBC;&#x505A;&#xFF1F;&#x5728; C&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>free(str);</code>&#x3002;&#x5177;&#x6709; garbage collection&#xFF08;&#x4F8B;&#x5982;&#xFF1A;Ruby&#x3001;Python&#x3001;Java&#x3001;JavaScript&#x3001;C&#xFF03;&#x3001;Go&#xFF09;&#x6A5F;&#x5236;&#x7684;&#x8A9E;&#x8A00;&#x80FD;&#x5920;&#x8FFD;&#x8E64;&#x8B8A;&#x6578;&#xFF0C;&#x4E26;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6642;&#x91CB;&#x653E;&#x5B83;&#x5011;&#x3002;&#x5783;&#x573E;&#x6536;&#x96C6;&#x589E;&#x52A0;&#x4E86;&#x8CA0;&#x64D4;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x89E3;&#x6C7A;&#x4E86;&#x4E00;&#x4E9B;&#x6703;&#x9020;&#x6210;&#x6BC0;&#x6EC5;&#x6027;&#x7684; bug &#x7684;&#x554F;&#x984C;&#x3002;</p><h2 id="&#x57F7;&#x884C;-go-&#x7A0B;&#x5F0F;&#x78BC;">&#x57F7;&#x884C; Go &#x7A0B;&#x5F0F;&#x78BC;</h2><p>&#x8B93;&#x6211;&#x5011;&#x958B;&#x59CB;&#x6211;&#x5011;&#x7684;&#x65C5;&#x7A0B;&#x5427;&#xFF01;&#x5EFA;&#x7ACB;&#x4E00;&#x500B;&#x7C21;&#x55AE;&#x7684;&#x7A0B;&#x5F0F;&#xFF0C;&#x5B78;&#x7FD2;&#x5982;&#x4F55;&#x7DE8;&#x8B6F;&#x548C;&#x57F7;&#x884C;&#x5B83;&#x3002;&#x6253;&#x958B;&#x4F60;&#x559C;&#x6B61;&#x7684;&#x7DE8;&#x8F2F;&#x5668;&#xFF0C;&#x4E26;&#x64B0;&#x5BEB;&#x4EE5;&#x4E0B;&#x7A0B;&#x5F0F;&#x78BC;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">func</span> main() {
  <span class="hljs-built_in">println</span>(<span class="hljs-string">&quot;it&apos;s over 9000!&quot;</span>)
}</code></pre>
<p>&#x5C07;&#x6A94;&#x6848;&#x53E6;&#x5B58;&#x70BA; <code>main.go</code>&#x3002;&#x73FE;&#x5728;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5132;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6211;&#x5011;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x9019;&#x500B;&#x5C0F;&#x7BC4;&#x4F8B;&#x653E;&#x5230;&#x5DE5;&#x4F5C;&#x76EE;&#x9304;&#x4E2D;&#x3002;</p><p>&#x63A5;&#x4E0B;&#x4F86;&#xFF0C;&#x6253;&#x958B; shell/command prompt&#xFF0C;&#x4E26;&#x5C07;&#x76EE;&#x9304;&#x5207;&#x63DB;&#x5230;&#x6A94;&#x6848;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5C0D;&#x6211;&#x4F86;&#x8AAA;&#xFF0C;&#x90A3;&#x662F;&#x5728; <code>cd ~/code</code>&#x3002;</p><p>&#x6700;&#x5F8C;&#xFF0C;&#x57F7;&#x884C;&#x7A0B;&#x5F0F;&#x78BC;&#xFF1A;</p><pre><code class="lang-sh">go run main.go</code></pre>
<p>&#x5982;&#x679C;&#x4E00;&#x5207;&#x6B63;&#x78BA;&#xFF0C;&#x4F60;&#x6703;&#x770B;&#x5230; <code>it&apos;s over 9000!</code>&#x3002;</p><p>&#x4F46;&#x7B49;&#x7B49;&#xFF0C;&#x7DE8;&#x8B6F;&#x7684;&#x6B65;&#x9A5F;&#x5462;&#xFF1F; <code>go run</code> &#x662F;&#x4E00;&#x500B;&#x540C;&#x6642;&#x9032;&#x884C;&#x7DE8;&#x8B6F;&#x548C;&#x57F7;&#x884C;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x5B83;&#x4F7F;&#x7528;&#x4E00;&#x500B;&#x81E8;&#x6642;&#x76EE;&#x9304;&#x4F86;&#x5EFA;&#x7F6E;&#x7A0B;&#x5F0F;&#x3001;&#x57F7;&#x884C;&#x5B83;&#x3001;&#x6700;&#x5F8C;&#x780D;&#x6389;&#x81EA;&#x5DF1;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x900F;&#x904E;&#x4EE5;&#x4E0B;&#x6307;&#x4EE4;&#x67E5;&#x770B;&#x81E8;&#x6642;&#x6A94;&#x6848;&#x7684;&#x4F4D;&#x7F6E;&#xFF1A;</p><pre><code class="lang-sh">go run --work main.go</code></pre>
<p>&#x60F3;&#x8981;&#x76F4;&#x63A5;&#x7DE8;&#x8B6F;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x4F7F;&#x7528; <code>go build</code>&#xFF1A;</p><pre><code class="lang-sh">go build main.go</code></pre>
<p>&#x9019;&#x500B;&#x6307;&#x4EE4;&#x6703;&#x7522;&#x751F;&#x4E00;&#x500B;&#x57F7;&#x884C;&#x6A94; <code>main</code>&#x3002;&#x5728; Linux/OSX &#x7CFB;&#x7D71;&#x4E2D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7528; <code>./main</code> &#x4F86;&#x57F7;&#x884C;&#x5B83;&#x3002;</p><p>&#x5728;&#x4F60;&#x958B;&#x767C;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x7528; <code>go run</code> &#x6216; <code>go build</code> &#x7B49;&#x6307;&#x4EE4;&#xFF0C;&#x4F46;&#x5728;&#x4F60;&#x90E8;&#x7F72;&#x7A0B;&#x5F0F;&#x6642;&#xFF0C;
&#x4F60;&#x6703;&#x5C31;&#x76F4;&#x63A5;&#x7DE8;&#x8B6F;&#x597D;&#x57F7;&#x884C;&#x6A94;&#xFF0C;&#x4E26;&#x4E14;&#x5C07;&#x57F7;&#x884C;&#x6A94;&#x9032;&#x884C;&#x90E8;&#x7F72;&#x3002;</p><h2 id="main">Main</h2><p>&#x5E0C;&#x671B;&#x6211;&#x5011;&#x4E0A;&#x9762;&#x57F7;&#x884C;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x662F;&#x597D;&#x7406;&#x89E3;&#x7684;&#x3002;&#x6211;&#x5011;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x500B;&#x51FD;&#x5F0F;&#xFF0C;&#x4E26;&#x4E14;&#x900F;&#x904E;&#x5167;&#x5EFA;&#x7684; <code>println</code> &#x51FD;&#x5F0F;&#x5370;&#x51FA;&#x5B57;&#x4E32;&#x3002;&#x7576;&#x6211;&#x5011;&#x57F7;&#x884C; <code>go run</code> &#x7684;&#x6642;&#x5019;&#xFF0C;Go &#x6703;&#x77E5;&#x9053;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x53EA;&#x6709;&#x55AE;&#x4E00;&#x7684;&#x4E00;&#x500B;&#x6A94;&#x6848;&#xFF0C;&#x800C;&#x77E5;&#x9053;&#x6211;&#x5011;&#x8981;&#x57F7;&#x884C;&#x7684;&#x5C31;&#x662F;&#x90A3;&#x96BB;&#x7A0B;&#x5F0F;&#x55CE;&#xFF1F;&#x4E0D;&#xFF0C;&#x5728; Go &#x8A9E;&#x8A00;&#x88E1;&#xFF0C;&#x7A0B;&#x5F0F;&#x7684;&#x9032;&#x5165;&#x9EDE;&#x662F;&#x5728; <code>main</code> package &#x88E1;&#x9762;&#x7684; <code>main</code> &#x51FD;&#x5F0F;&#x3002;</p><p>&#x6211;&#x5011;&#x6703;&#x5728;&#x5F8C;&#x9762;&#x7684;&#x7AE0;&#x7BC0;&#x8A0E;&#x8AD6; packege &#x7684;&#x6982;&#x5FF5;&#x3002;&#x73FE;&#x5728;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x8981;&#x4E86;&#x89E3; Go &#x7684;&#x57FA;&#x790E;&#x5C31;&#x597D;&#x3002;
&#x5728;&#x9019;&#x88E1;&#xFF0C;&#x6211;&#x5011;&#x4E00;&#x5F8B;&#x5C07;&#x6211;&#x5011;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x5BEB;&#x5728; <code>main</code> package &#x4E2D;&#x3002;</p><p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x8A66;&#x8A66;&#x770B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8B8A;&#x66F4; package &#x7684;&#x540D;&#x7A31;&#xFF0C;&#x63A5;&#x8457;&#x4E00;&#x6A23;&#x57F7;&#x884C;&#x7A0B;&#x5F0F;&#xFF0C;&#x770B;&#x770B;&#x6703;&#x8DD1;&#x51FA;&#x4EC0;&#x9EBC;&#x932F;&#x8AA4;&#x8A0A;&#x606F;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x628A; package &#x6539;&#x56DE; <code>main</code>&#xFF0C;&#x4F46;&#x662F;&#x8B8A;&#x66F4;&#x51FD;&#x5F0F;&#x7684;&#x540D;&#x7A31;&#xFF0C;&#x53C8;&#x6703;&#x8DD1;&#x51FA;&#x4EC0;&#x9EBC;&#x932F;&#x8AA4;&#x8A0A;&#x606F;&#x3002;&#x5617;&#x8A66;&#x57F7;&#x884C;&#x4E00;&#x6A23;&#x7684;&#x8B8A;&#x66F4;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x57F7;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x53BB;&#x7DE8;&#x8B6F;&#x4ED6;&#xFF0C;&#x7DE8;&#x8B6F;&#x6642;&#xFF0C;&#x4F60;&#x6703;&#x767C;&#x73FE;&#x9019;&#x6C92;&#x6709;&#x9032;&#x5165;&#x9EDE;&#x7684;&#x7DE8;&#x8B6F;&#x3002;&#x7576;&#x4F60;&#x5728;&#x7DE8;&#x8B6F;&#x4E00;&#x500B;&#x5957;&#x4EF6;&#x6642;&#xFF0C;&#x9019;&#x662F;&#x76F8;&#x7576;&#x6B63;&#x5E38;&#x7684;&#x3002;</p><h2 id="import">Import</h2><p>Go &#x6709;&#x76F8;&#x7576;&#x591A;&#x5167;&#x5EFA;&#x7684;&#x51FD;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;<code>println</code> &#x53EF;&#x4EE5;&#x4E0D;&#x9700;&#x8981;&#x5F15;&#x7528;&#x4EFB;&#x4F55;&#x5957;&#x4EF6;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;&#x5373;&#x4F7F;&#x6211;&#x5011;&#x4F7F;&#x7528;&#x7B2C;&#x4E09;&#x65B9;&#x5957;&#x4EF6;&#xFF0C;&#x4E0D;&#x4F7F;&#x7528;&#x5167;&#x5EFA;&#x7684;&#x51FD;&#x5F0F;&#x5E7E;&#x4E4E;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x5728; Go &#x4E2D;&#xFF0C;&#x4F7F;&#x7528; <code>import</code> &#x95DC;&#x9375;&#x5B57;&#x53EF;&#x4EE5;&#x7528;&#x4F86;&#x5F15;&#x7528;&#x5728;&#x7A0B;&#x5F0F;&#x78BC;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x76F8;&#x95DC;&#x5957;&#x4EF6;&#x3002;</p><p>&#x8B93;&#x6211;&#x5011;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#x539F;&#x672C;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
  <span class="hljs-string">&quot;fmt&quot;</span>
  <span class="hljs-string">&quot;os&quot;</span>
)

<span class="hljs-keyword">func</span> main() {
  <span class="hljs-keyword">if</span> <span class="hljs-built_in">len</span>(os.Args) != <span class="hljs-number">2</span> {
    os.Exit(<span class="hljs-number">1</span>)
  }
  fmt.Println(<span class="hljs-string">&quot;It&apos;s over&quot;</span>, os.Args[<span class="hljs-number">1</span>])
}</code></pre>
<p>&#x900F;&#x904E;&#x4EE5;&#x4E0B;&#x6307;&#x4EE4;&#x4F86;&#x57F7;&#x884C;&#xFF1A;</p><pre><code class="lang-sh">go run main.go 9000</code></pre>
<p>&#x6211;&#x5011;&#x73FE;&#x5728;&#x4F7F;&#x7528;&#x5169;&#x500B; Go &#x7684;&#x6A19;&#x6E96;&#x5957;&#x4EF6;&#xFF1A;<code>fmt</code> &#x548C; <code>os</code>&#x3002;&#x540C;&#x6642;&#x4E5F;&#x6703;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x500B;&#x5167;&#x5EFA;&#x7684;&#x51FD;&#x5F0F; <code>len</code>&#x3002;<code>len</code> &#x6703;&#x50B3;&#x56DE; string &#x7684;&#x9577;&#x5EA6;&#xFF0C;&#x6216;&#x662F;&#x4E00;&#x500B; dictionary &#x7684;&#x6578;&#x91CF;&#xFF0C;&#x4EA6;&#x6216;&#x662F;&#x6211;&#x5011;&#x9019;&#x88E1;&#x770B;&#x5230;&#x7684; array &#x7684;&#x9577;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x70BA;&#x4EC0;&#x9EBC;&#x6211;&#x5011;&#x7684;&#x7A0B;&#x5F0F;&#x662F;&#x5B58;&#x53D6;&#x7B2C;&#x4E8C;&#x500B;&#x53C3;&#x6578;&#xFF0C;&#x90A3;&#x662F;&#x56E0;&#x70BA;&#x7B2C;&#x4E00;&#x500B;&#x53C3;&#x6578; (index &#x662F; 0) &#x4EE3;&#x8868;&#x7684;&#x662F;&#x76EE;&#x524D;&#x57F7;&#x884C;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x8DEF;&#x5F91;&#x3002;</p><p>&#x4F60;&#x6216;&#x8A31;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x6211;&#x5011;&#x5728;&#x51FD;&#x6578;&#x7684;&#x524D;&#x9762;&#x591A;&#x4E86;&#x524D;&#x7DB4;&#x540D;&#x7A31; <code>fmt.Println</code>&#x3002;&#x9019;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x8A9E;&#x8A00;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x5011;&#x6703;&#x5728;&#x5F8C;&#x9762;&#x8AC7;&#x8AD6;&#x5230; package&#x3002;&#x73FE;&#x5728;&#xFF0C;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528; import &#x548C; package &#x5C31;&#x5920;&#x4E86;&#x3002;</p><p>Go &#x5C0D;&#x65BC;&#x5982;&#x4F55;&#x4F7F;&#x7528; import &#x4F86;&#x5F15;&#x5165;&#x5957;&#x4EF6;&#x7684;&#x7BA1;&#x7406;&#x4E0A;&#x662F;&#x56B4;&#x683C;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60; import &#x4E86;&#x5957;&#x4EF6;&#xFF0C;
&#x537B;&#x6C92;&#x6709;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x8A71;&#xFF0C;&#x662F;&#x7121;&#x6CD5;&#x7DE8;&#x8B6F;&#x6210;&#x529F;&#x7684;&#x3002;&#x5617;&#x8A66;&#x57F7;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
  <span class="hljs-string">&quot;fmt&quot;</span>
  <span class="hljs-string">&quot;os&quot;</span>
)

<span class="hljs-keyword">func</span> main() {
}</code></pre>
<p>&#x4F60;&#x6703;&#x5F97;&#x5230;&#x5169;&#x500B;&#x932F;&#x8AA4;&#x8A0A;&#x606F;&#xFF0C;&#x544A;&#x8A34;&#x4F60; <code>fmt</code> &#x548C; <code>os</code> &#x9019;&#x5169;&#x500B;&#x5957;&#x4EF6;&#x88AB;&#x5F15;&#x7528;&#x4F46;&#x537B;&#x7121;&#x6CD5;&#x4F7F;&#x7528;&#x3002;&#x89BA;&#x5F97;&#x56F0;&#x64FE;&#x55CE;&#xFF1F;&#x80AF;&#x5B9A;&#x7684;&#xFF0C;&#x4F46;&#x96A8;&#x8457;&#x4E0D;&#x65B7;&#x5B78;&#x7FD2;&#xFF0C;&#x4F60;&#x6703;&#x7FD2;&#x6163;&#x7684;(&#x5118;&#x7BA1;&#x4F60;&#x4ECD;&#x7136;&#x6703;&#x611F;&#x5230;&#x56F0;&#x64FE;)&#x3002;Go &#x6703;&#x9019;&#x9EBC;&#x56B4;&#x683C;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5F15;&#x7528;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x5957;&#x4EF6;&#x6703;&#x4F7F;&#x5F97;&#x7DE8;&#x8B6F;&#x901F;&#x5EA6;&#x8B8A;&#x6162;&#xFF0C;&#x5118;&#x7BA1;&#xFF0C;&#x5927;&#x591A;&#x6578;&#x4EBA;&#x53EF;&#x80FD;&#x4E0D;&#x6703;&#x6709;&#x9019;&#x7A2E;&#x7A0B;&#x5EA6;&#x7684;&#x56F0;&#x64FE;&#x3002;</p><p>&#x53E6;&#x4E00;&#x500B;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;Go &#x7684;&#x6A19;&#x6E96;&#x51FD;&#x5F0F;&#x5EAB;&#x6709;&#x76F8;&#x7576;&#x826F;&#x597D;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5230; <a href="https://golang.org/pkg/fmt/#Println" target="_blank">https://golang.org/pkg/fmt/#Println</a> &#x95B1;&#x8B80;&#x95DC;&#x65BC; <code>fmt</code> &#x5957;&#x4EF6;&#x4E2D; <code>Println</code> &#x51FD;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x9EDE;&#x64CA;&#x89C0;&#x770B;&#x539F;&#x59CB;&#x78BC;&#x3002;</p><p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x96FB;&#x8166;&#x7121;&#x6CD5;&#x9023;&#x4E0A;&#x7DB2;&#x8DEF;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x6A5F;&#x7AEF;&#x8F38;&#x5165;&#xFF1A;</p><pre><code class="lang-sh">godoc -http=:6060</code></pre>
<p>&#x7136;&#x5F8C;&#x5728;&#x700F;&#x89BD;&#x5668;&#x4E0A;&#x5230; <code>http://localhost:6060</code> &#x4F86;&#x6AA2;&#x8996;&#x6587;&#x4EF6;&#x3002;</p><h2 id="&#x8B8A;&#x6578;&#x8207;&#x5BA3;&#x544A;">&#x8B8A;&#x6578;&#x8207;&#x5BA3;&#x544A;</h2><p>&#x7576;&#x6211;&#x5011;&#x5BEB;&#x4E0B; <code>x = 4</code>&#xFF0C;&#x9019;&#x5C0D;&#x65BC;&#x8B8A;&#x6578;&#x7684;&#x5BA3;&#x544A;&#x4F86;&#x8AAA;&#xFF0C;&#x4E5F;&#x8A31;&#x662F;&#x4E00;&#x500B;&#x958B;&#x59CB;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x7D50;&#x675F;&#x3002;&#x4F46;&#x4E0D;&#x5E78;&#x7684;&#xFF0C;&#x5728; Go &#x4E2D;&#xFF0C;&#x4E8B;&#x60C5;&#x76F8;&#x5C0D;&#x8907;&#x96DC;&#x4E86;&#x4E9B;&#x3002;&#x6211;&#x5011;&#x6703;&#x5F9E;&#x7C21;&#x55AE;&#x7684;&#x7BC4;&#x4F8B;&#x958B;&#x59CB;&#xFF0C;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#x4F7F;&#x7528; structure &#x7684;&#x6642;&#x5019;&#xFF0C;&#x4F86;&#x64F4;&#x5C55;&#x6211;&#x5011;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x60F3;&#x8AAA;&#xFF0C;&#x54C7;&#xFF0C;&#x662F;&#x4EC0;&#x9EBC;&#x4E8B;&#x60C5;&#x6703;&#x9019;&#x9EBC;&#x8907;&#x96DC;&#xFF1F;&#x8B93;&#x6211;&#x5011;&#x5148;&#x4F86;&#x770B;&#x4E9B;&#x4F8B;&#x5B50;&#x3002; &#x5728; Go &#x4E2D;&#xFF0C;&#x5BA3;&#x544A;&#x8B8A;&#x6578;&#x6700;&#x660E;&#x78BA;&#x4E5F;&#x662F;&#x6700;&#x5197;&#x9577;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
  <span class="hljs-string">&quot;fmt&quot;</span>
)

<span class="hljs-keyword">func</span> main() {
  <span class="hljs-keyword">var</span> power <span class="hljs-keyword">int</span>
  power = <span class="hljs-number">9000</span>
  fmt.Printf(<span class="hljs-string">&quot;It&apos;s over %d\n&quot;</span>, power)
}</code></pre>
<p>&#x9019;&#x88E1;&#xFF0C;&#x6211;&#x5011;&#x5BA3;&#x544A;&#x4E86;&#x4E00;&#x500B; <code>int</code> &#x985E;&#x578B;&#x7684; <code>power</code> &#x8B8A;&#x6578;&#xFF0C;&#x9810;&#x8A2D;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;Go &#x6703;&#x70BA;&#x9019;&#x500B;&#x8B8A;&#x6578;&#x5206;&#x914D;&#x4E00;&#x500B;&#x96F6;&#x503C;&#x3002;&#x6574;&#x6578;&#x7684;&#x8A71;&#x662F; <code>0</code>&#x3001;&#x5E03;&#x6797;&#x503C;&#x70BA; <code>false</code>&#x3001;&#x5B57;&#x4E32;&#x662F; <code>&quot;&quot;</code> &#x7B49;&#x3002;&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x5011;&#x5C07; <code>9000</code> &#x6307;&#x6D3E;&#x7D66; <code>power</code> &#x9019;&#x500B;&#x8B8A;&#x6578;&#x3002;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5408;&#x4F75;&#x9019;&#x5169;&#x884C;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">var</span> power <span class="hljs-keyword">int</span> = <span class="hljs-number">9000</span></code></pre>
<p>&#x9019;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x6253;&#x5F88;&#x591A;&#x5B57;&#x3002;&#x5728; Go &#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x500B;&#x65B9;&#x4FBF;&#x7684;&#x7C21;&#x77ED;&#x5BA3;&#x544A;&#x904B;&#x7B97;&#x5B50;&#xFF1A;<code>:=</code>&#xFF0C;&#x9019;&#x500B;&#x904B;&#x7B97;&#x5B50;&#x53EF;&#x4EE5;&#x9032;&#x884C;&#x578B;&#x5225;&#x7684;&#x63A8;&#x8AD6;&#xFF1A;</p><pre><code class="lang-go">power := <span class="hljs-number">9000</span></code></pre>
<p>&#x9019;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x540C;&#x6642;&#x5728;&#x51FD;&#x5F0F;&#x4E0A;&#x4E5F;&#x80FD;&#x9019;&#x6A23;&#x4F7F;&#x7528;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> main() {
  power := getPower()
}

<span class="hljs-keyword">func</span> getPower() <span class="hljs-keyword">int</span> {
  <span class="hljs-keyword">return</span> <span class="hljs-number">9001</span>
}</code></pre>
<p>&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8981;&#x8A18;&#x4F4F; <code>:=</code> &#x540C;&#x6642;&#x7528;&#x65BC;&#x5BA3;&#x544A;&#x8B8A;&#x6578;&#x4EE5;&#x53CA;&#x70BA;&#x5B83;&#x8CE6;&#x503C;&#x3002;&#x70BA;&#x4EC0;&#x9EBC;&#xFF1F; &#x56E0;&#x70BA;&#x8B8A;&#x6578;&#x4E0D;&#x80FD;&#x88AB;&#x5BA3;&#x544A;&#x5169;&#x6B21;&#xFF08;&#x5728;&#x540C;&#x4E00;&#x7BC4;&#x570D;&#x5167;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5617;&#x8A66;&#x57F7;&#x884C;&#x4EE5;&#x4E0B;&#x64CD;&#x4F5C;&#xFF0C;&#x6703;&#x6536;&#x5230;&#x932F;&#x8AA4;&#x3002;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> main() {
  power := <span class="hljs-number">9000</span>
  fmt.Printf(<span class="hljs-string">&quot;It&apos;s over %d\n&quot;</span>, power)

  <span class="hljs-comment">// &#x7DE8;&#x8B6F;&#x932F;&#x8AA4;&#xFF1A;</span>
  <span class="hljs-comment">// &#x5728; := &#x7684;&#x5DE6;&#x65B9;&#x6C92;&#x6709;&#x65B0;&#x7684;&#x8B8A;&#x6578;&#x6307;&#x6D3E;</span>
  power := <span class="hljs-number">9001</span>
  fmt.Printf(<span class="hljs-string">&quot;It&apos;s also over %d\n&quot;</span>, power)
}</code></pre>
<p>&#x7DE8;&#x8B6F;&#x5668;&#x6703;&#x62B1;&#x6028;&#x5728; <code>:=</code> &#x904B;&#x7B97;&#x5B50;&#x7684;&#x5DE6;&#x5074;&#x6C92;&#x6709;&#x65B0;&#x7684;&#x8B8A;&#x6578;&#x3002;&#x9019;&#x4EE3;&#x8868;&#xFF0C;&#x7576;&#x6211;&#x5011;&#x9996;&#x6B21;&#x5BA3;&#x544A;&#x4E00;&#x500B;&#x8B8A;&#x6578;&#x6642;&#xFF0C;&#x6211;&#x5011;&#x4F7F;&#x7528; <code>:=</code> &#x904B;&#x7B97;&#x5B50;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5F8C;&#x7E8C;&#x8CE6;&#x503C;&#x4E2D;&#xFF0C;&#x6211;&#x5011;&#x4F7F;&#x7528;&#x8CE6;&#x503C;&#x904B;&#x7B97;&#x5B50; <code>=</code>&#x3002;&#x9019;&#x76F8;&#x7576;&#x5408;&#x7406;&#xFF0C;&#x4F46;&#x6703;&#x6709;&#x9EDE;&#x5FAE;&#x5999;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x591A;&#x7DF4;&#x7FD2;&#x4F86;&#x8B93;&#x4F60;&#x7684;&#x808C;&#x8089;&#x53EF;&#x4EE5;&#x9806;&#x5229;&#x7684;&#x5728;&#x9019;&#x5169;&#x8005;&#x4E4B;&#x9593;&#x9032;&#x884C;&#x8F49;&#x63DB;&#x3002;</p><p>&#x5982;&#x679C;&#x4F60;&#x4ED4;&#x7D30;&#x95B1;&#x8B80;&#x932F;&#x8AA4;&#x8A0A;&#x606F;&#xFF0C;&#x4F60;&#x6703;&#x6CE8;&#x610F;&#x5230;&#x8B8A;&#x6578;&#x662F;&#x8907;&#x6578;&#x3002;&#x9019;&#x662F;&#x56E0;&#x70BA; Go &#x5141;&#x8A31;&#x4F60;&#x6307;&#x6D3E;&#x591A;&#x500B;&#x8B8A;&#x6578;&#xFF08;&#x4F7F;&#x7528; <code>=</code> &#x6216; <code>:=</code> &#x7686;&#x53EF;&#xFF09;&#x3002;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> main() {
  name, power := <span class="hljs-string">&quot;Goku&quot;</span>, <span class="hljs-number">9000</span>
  fmt.Printf(<span class="hljs-string">&quot;%s&apos;s power is over %d\n&quot;</span>, name, power)
}</code></pre>
<p>&#x4E00;&#x65E6;&#x9019;&#x500B;&#x8B8A;&#x6578;&#x662F;&#x65B0;&#x7684;&#xFF0C;<code>:=</code> &#x904B;&#x7B97;&#x5B50;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x4F7F;&#x7528;&#x3002;&#x770B;&#x770B;&#x4EE5;&#x4E0B;&#x7684;&#x7BC4;&#x4F8B;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> main() {
  power := <span class="hljs-number">1000</span>
  fmt.Printf(<span class="hljs-string">&quot;default power is %d\n&quot;</span>, power)

  name, power := <span class="hljs-string">&quot;Goku&quot;</span>, <span class="hljs-number">9000</span>
  fmt.Printf(<span class="hljs-string">&quot;%s&apos;s power is over %d\n&quot;</span>, name, power)
}</code></pre>
<p>&#x96D6;&#x7136; power &#x9019;&#x500B;&#x8B8A;&#x6578;&#x88AB; <code>:=</code> &#x6307;&#x6D3E;&#x5169;&#x6B21;&#xFF0C;&#x7DE8;&#x8B6F;&#x5668;&#x537B;&#x4E0D;&#x6703;&#x7522;&#x751F;&#x932F;&#x8AA4;&#x3002;&#x7DE8;&#x8B6F;&#x5668;&#x6703;&#x770B;&#x5230;&#x6709;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x8B8A;&#x6578; <code>name</code>&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x4F7F;&#x7528; <code>:=</code>&#x3002;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x8B8A;&#x66F4; power &#x9019;&#x500B;&#x8B8A;&#x6578;&#x7684;&#x578B;&#x614B;&#xFF0C;&#x56E0;&#x70BA;&#x4ED6;&#x88AB;&#x96B1;&#x6027;&#x7684;&#x6307;&#x6D3E;&#x70BA;&#x6574;&#x6578;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x88AB;&#x6574;&#x6578;&#x8CE6;&#x503C;&#x3002;</p><p>&#x73FE;&#x5728;&#xFF0C;&#x4F60;&#x8981;&#x77E5;&#x9053;&#x7684;&#x6700;&#x5F8C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x5C31;&#x8DDF; import &#x4E00;&#x6A23;&#xFF0C;Go &#x4E0D;&#x6703;&#x8B93;&#x4F60;&#x6709;&#x5BA3;&#x544A;&#x4F46;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x8B8A;&#x6578;&#x3002;&#x770B;&#x770B;&#x9019;&#x500B;&#x4F8B;&#x5B50;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> main() {
  name, power := <span class="hljs-string">&quot;Goku&quot;</span>, <span class="hljs-number">1000</span>
  fmt.Printf(<span class="hljs-string">&quot;default power is %d\n&quot;</span>, power)
}</code></pre>
<p>&#x5C07;&#x7121;&#x6CD5;&#x7DE8;&#x8B6F;&#x6210;&#x529F;&#x3002;&#x56E0;&#x70BA; <code>name</code> &#x8B8A;&#x6578;&#x5BA3;&#x544A;&#x4E86;&#x4F46;&#x6C92;&#x6709;&#x88AB;&#x4F7F;&#x7528;&#x3002;&#x5C31;&#x50CF; import &#x4E86;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x5957;&#x4EF6;&#x4E00;&#x6A23;&#xFF0C;&#x9019;&#x53EF;&#x80FD;&#x6703;&#x8B93;&#x67D0;&#x4E9B;&#x4EBA;&#x89BA;&#x5F97;&#x6CAE;&#x55AA;&#xFF0C;&#x4F46;&#x6574;&#x9AD4;&#x4F86;&#x770B;&#xFF0C;&#x6211;&#x8A8D;&#x70BA;&#x9019;&#x5C0D;&#x65BC;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x6574;&#x6F54;&#x5EA6;&#x548C;&#x53EF;&#x8B80;&#x6027;&#x662F;&#x6709;&#x6240;&#x5E6B;&#x52A9;&#x7684;&#x3002;</p><p>&#x95DC;&#x65BC;&#x8B8A;&#x6578;&#x7684;&#x5BA3;&#x544A;&#x548C;&#x6307;&#x6D3E;&#x9084;&#x6709;&#x66F4;&#x591A;&#x53EF;&#x4EE5;&#x5B78;&#x7FD2;&#x7684;&#x90E8;&#x5206;&#x3002;&#x73FE;&#x5728;&#xFF0C;&#x4F60;&#x8981;&#x8A18;&#x4F4F;&#xFF0C;&#x4F7F;&#x7528; <code>var NAME TYPE</code> &#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x5BA3;&#x544A;&#x4E00;&#x500B;&#x8B8A;&#x6578;&#x6703;&#x88AB;&#x8CE6;&#x4E88;&#x8A72;&#x8B8A;&#x6578;&#x7684;&#x96F6;&#x503C;&#xFF0C;&#x4F7F;&#x7528; <code>NAME := VALUE</code> &#x662F;&#x5BA3;&#x544A;&#x8B8A;&#x6578;&#x4E26;&#x8CE6;&#x503C;&#xFF0C;&#x800C; <code>NAME = VALUE</code> &#x662F;&#x6307;&#x6D3E;&#x4E00;&#x500B;&#x503C;&#x7D66;&#x4E4B;&#x524D;&#x5BA3;&#x544A;&#x904E;&#x7684;&#x8B8A;&#x6578;&#x3002;</p><h2 id="&#x51FD;&#x5F0F;&#x5BA3;&#x544A;">&#x51FD;&#x5F0F;&#x5BA3;&#x544A;</h2><p>&#x5728;&#x5B78;&#x7FD2;&#x5B8C;&#x8B8A;&#x6578;&#x5BA3;&#x544A;&#x5F8C;&#xFF0C;&#x73FE;&#x5728;&#x6B63;&#x662F;&#x4E00;&#x500B;&#x597D;&#x6642;&#x6A5F;&#x8B93;&#x4F60;&#x77E5;&#x9053;&#xFF0C;Go &#x7684;&#x51FD;&#x5F0F;&#x662F;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x500B;&#x56DE;&#x50B3;&#x503C;&#x7684;&#x3002;&#x8B93;&#x6211;&#x5011;&#x4F86;&#x770B;&#x770B;&#x4E09;&#x500B;&#x51FD;&#x5F0F;&#xFF0C;&#x4E00;&#x500B;&#x6C92;&#x6709;&#x56DE;&#x50B3;&#x503C;&#x3001;&#x4E00;&#x500B;&#x56DE;&#x50B3;&#x4E00;&#x500B;&#x503C;&#xFF0C;&#x6700;&#x5F8C;&#x4E00;&#x500B;&#x56DE;&#x50B3;&#x5169;&#x500B;&#x503C;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> log(message <span class="hljs-keyword">string</span>) {
}

<span class="hljs-keyword">func</span> add(a <span class="hljs-keyword">int</span>, b <span class="hljs-keyword">int</span>) <span class="hljs-keyword">int</span> {
}

<span class="hljs-keyword">func</span> power(name <span class="hljs-keyword">string</span>) (<span class="hljs-keyword">int</span>, <span class="hljs-keyword">bool</span>) {
}</code></pre>
<p>&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x9019;&#x6A23;&#x4F7F;&#x7528;&#x591A;&#x56DE;&#x50B3;&#x503C;&#x7684;&#x51FD;&#x5F0F;&#xFF1A;</p><pre><code class="lang-go">value, exists := power(<span class="hljs-string">&quot;goku&quot;</span>)
<span class="hljs-keyword">if</span> exists == <span class="hljs-literal">false</span> {
  <span class="hljs-comment">// &#x8655;&#x7406;&#x932F;&#x8AA4;&#x60C5;&#x6CC1;</span>
}</code></pre>
<p>&#x6709;&#x6642;&#x5019;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x5176;&#x4E2D;&#x4E00;&#x500B;&#x56DE;&#x50B3;&#x503C;&#x3002;&#x5728;&#x9019;&#x7A2E;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C07;&#x4E0D;&#x9700;&#x8981;&#x8655;&#x7406;&#x7684;&#x8B8A;&#x6578;&#xFF0C;&#x7528; <code>_</code> &#x4F86;&#x53D6;&#x4EE3;&#xFF1A;</p><pre><code class="lang-go">_, exists := power(<span class="hljs-string">&quot;goku&quot;</span>)
<span class="hljs-keyword">if</span> exists == <span class="hljs-literal">false</span> {
  <span class="hljs-comment">// &#x8655;&#x7406;&#x932F;&#x8AA4;&#x60C5;&#x6CC1;</span>
}</code></pre>
<p>&#x9019;&#x7A2E;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x4E0D;&#x50C5;&#x50C5;&#x662F;&#x4E00;&#x7A2E;&#x5E38;&#x898F;&#xFF0C;<code>_</code> &#x7A7A;&#x767D;&#x8B58;&#x5225;&#x7B26;&#x865F;&#x662F;&#x7279;&#x5225;&#x7528;&#x5728;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x5BE6;&#x969B;&#x6307;&#x6D3E;&#x7684;&#x6642;&#x5019;&#x4F7F;&#x7528;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x7BA1;&#x8FD4;&#x56DE;&#x7684;&#x985E;&#x578B;&#xFF0C;&#x91CD;&#x8907;&#x7684;&#x4F7F;&#x7528; <code>_</code> &#x8B58;&#x5225;&#x7B26;&#x865F;&#x3002;</p><p>&#x6700;&#x5F8C;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x51FD;&#x5F0F;&#x6240;&#x7528;&#x5230;&#x7684;&#x53C3;&#x6578;&#x5171;&#x7528;&#x540C;&#x4E00;&#x7A2E;&#x985E;&#x578B;&#x7684;&#x8A71;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x7528;&#x8F03;&#x77ED;&#x7684;&#x8A9E;&#x6CD5;&#x5BA3;&#x544A;&#xFF08;&#x5982;&#x4E0B;&#x65B9;&#x7684; a&#x3001;b &#x8B8A;&#x6578;&#x5171;&#x7528;&#x6574;&#x6578;&#x578B;&#x614B;&#x7684;&#x5BA3;&#x544A;&#xFF09;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> add(a, b <span class="hljs-keyword">int</span>) <span class="hljs-keyword">int</span> {

}</code></pre>
<p>&#x51FD;&#x5F0F;&#x591A;&#x91CD;&#x8FD4;&#x56DE;&#x503C;&#x548C;&#x4F7F;&#x7528; <code>_</code> &#x4F86;&#x4E1F;&#x68C4;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x56DE;&#x50B3;&#x503C;&#x662F;&#x5F88;&#x5E38;&#x7528;&#x5230;&#x7684;&#x529F;&#x80FD;&#x3002;&#x547D;&#x540D;&#x8FD4;&#x56DE;&#x503C;&#x548C;&#x5C11;&#x91CF;&#x7684; verbose &#x53C3;&#x6578;&#x5BA3;&#x544A;&#x4E0D;&#x662F;&#x90A3;&#x9EBC;&#x5E38;&#x898B;&#x3002;&#x4E0D;&#x904E;&#x4F60;&#x9072;&#x65E9;&#x6703;&#x4F7F;&#x7528;&#x5B83;&#x5011;&#xFF0C;&#x6240;&#x4EE5;&#x4E86;&#x89E3;&#x4ED6;&#x5011;&#x9084;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;</p><h2 id="&#x5728;&#x4F60;&#x7E7C;&#x7E8C;&#x5B78;&#x7FD2;&#x4E4B;&#x524D;">&#x5728;&#x4F60;&#x7E7C;&#x7E8C;&#x5B78;&#x7FD2;&#x4E4B;&#x524D;</h2><p>&#x6211;&#x5011;&#x5B78;&#x7FD2;&#x4E86;&#x4E00;&#x4E9B;&#x5C0F;&#x90E8;&#x5206;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x89BA;&#x5F97;&#x6709;&#x9EDE;&#x96F6;&#x6563;&#x3002;&#x6211;&#x5011;&#x6703;&#x6162;&#x6162;&#x5B78;&#x7FD2;&#x4E00;&#x4E9B;&#x66F4;&#x5927;&#x7684;&#x7A0B;&#x5F0F;&#xFF0C;&#x5C46;&#x6642;&#x9019;&#x4E9B;&#x90E8;&#x5206;&#x5C07;&#x6703;&#x805A;&#x96C6;&#x6210;&#x5B8C;&#x6574;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;</p><p>&#x5982;&#x679C;&#x4F60;&#x4E4B;&#x524D;&#x662F;&#x5B78;&#x7FD2;&#x52D5;&#x614B;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#xFF0C;&#x4F60;&#x6216;&#x8A31;&#x6703;&#x89BA;&#x5F97;&#x8907;&#x96DC;&#x7684;&#x578B;&#x5225;&#x548C;&#x5BA3;&#x544A;&#x662F;&#x4E00;&#x7A2E;&#x9000;&#x6B65;&#x3002;&#x4F46;&#x6211;&#x4E26;&#x4E0D;&#x8A8D;&#x540C;&#x9019;&#x6A23;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5C0D;&#x65BC;&#x67D0;&#x4E9B;&#x7CFB;&#x7D71;&#xFF0C;&#x4E5F;&#x8A31;&#x52D5;&#x614B;&#x8A9E;&#x8A00;&#x6703;&#x66F4;&#x6709;&#x751F;&#x7522;&#x529B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E4B;&#x524D;&#x662F;&#x5B78;&#x7FD2;&#x975C;&#x614B;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#xFF0C;&#x4F60;&#x4E5F;&#x8A31;&#x5728;&#x5B78;&#x7FD2; Go &#x7684;&#x904E;&#x7A0B;&#x662F;&#x89BA;&#x5F97;&#x719F;&#x6089;&#x7684;&#xFF0C;&#x63A8;&#x8AD6;&#x7684;&#x578B;&#x5225;&#x548C;&#x591A;&#x56DE;&#x50B3;&#x503C;&#x662F;&#x76F8;&#x7576;&#x597D;&#x7684;&#x7279;&#x6027;&#xFF08;&#x5118;&#x7BA1;&#x4E26;&#x975E; Go &#x6240;&#x7368;&#x6709;&#xFF09;&#x3002;&#x5E0C;&#x671B;&#x96A8;&#x8457;&#x6211;&#x5011;&#x5B78;&#x7FD2;&#x66F4;&#x591A;&#xFF0C;&#x6703;&#x5C0D;&#x65BC; Go &#x4E7E;&#x6DE8;&#x7C21;&#x6F54;&#x7684;&#x8A9E;&#x6CD5;&#x6703;&#x66F4;&#x52A0;&#x6B23;&#x8CDE;&#x3002;</p>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="getting-started.html" class="navigation navigation-prev " aria-label="Previous page: 入門">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter2.html" class="navigation navigation-next " aria-label="Next page: 第二章 - 結構">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章 - 基本概念","level":"1.5","depth":1,"next":{"title":"第二章 - 結構","level":"1.6","depth":1,"path":"chapter2.md","ref":"./chapter2.md","articles":[]},"previous":{"title":"入門","level":"1.4","depth":1,"path":"getting-started.md","ref":"./getting-started.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"github":{"url":"https://github.com/kevingo/the-little-go-book"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"The Little Go Book 繁體中文翻譯版","gitbook":"3.2.0"},"file":{"path":"chapter1.md","mtime":"2017-03-07T03:33:15.596Z","type":"markdown"},"gitbook":{"version":"3.2.0","time":"2017-03-07T03:34:24.460Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

