
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>第六章 - 並行 · The Little Go Book 繁體中文翻譯版</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.0">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="conclusion.html" />
    
    
    <link rel="prev" href="chapter5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="about.html">
            
                <a href="about.html">
            
                    
                    關於本書
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    簡介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="getting-started.html">
            
                <a href="getting-started.html">
            
                    
                    入門
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章 - 基本概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章 - 結構
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章 - Map、Array、和 Slice
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章 - 組織程式碼和介面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章 - 花絮
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章 - 並行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    結論
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第六章 - 並行</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x516D;&#x7AE0;---&#x4E26;&#x884C;">&#x7B2C;&#x516D;&#x7AE0; - &#x4E26;&#x884C;</h1><p>Go &#x7D93;&#x5E38;&#x88AB;&#x63CF;&#x8FF0;&#x70BA;&#x9069;&#x5408;&#x7528;&#x5728;&#x4E26;&#x884C;&#x5316;&#x8655;&#x7406;&#x7684;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x3002;&#x4E3B;&#x8981;&#x7684;&#x539F;&#x56E0;&#x5728;&#x65BC;&#xFF0C;Go &#x5728;&#x4E26;&#x884C;&#x5316;&#x4E0A;&#x63D0;&#x4F9B;&#x4E86;&#x5169;&#x7A2E;&#x7C21;&#x55AE;&#x4E14;&#x5F37;&#x5927;&#x7684;&#x6A5F;&#x5236;&#xFF1A;goroutine &#x548C; channel&#x3002;</p><h2 id="goroutine">Goroutine</h2><p>goroutine &#x6709;&#x9EDE;&#x985E;&#x4F3C;&#x65BC;&#x57F7;&#x884C;&#x7DD2;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x7531; Go &#x81EA;&#x5DF1;&#x4F86;&#x8ABF;&#x5EA6;&#x5B89;&#x6392;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7531;&#x4F5C;&#x696D;&#x7CFB;&#x7D71;&#x3002;&#x7576;&#x4F60;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x5728;&#x4E00;&#x500B; goroutine &#x4E2D;&#x57F7;&#x884C;&#x6642;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x4E26;&#x884C;&#x57F7;&#x884C;&#x3002;&#x8B93;&#x6211;&#x5011;&#x4F86;&#x770B;&#x500B;&#x4F8B;&#x5B50;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
  <span class="hljs-string">&quot;fmt&quot;</span>
  <span class="hljs-string">&quot;time&quot;</span>
)

<span class="hljs-keyword">func</span> main() {
  fmt.Println(<span class="hljs-string">&quot;start&quot;</span>)
  <span class="hljs-keyword">go</span> process()
  time.Sleep(time.Millisecond * <span class="hljs-number">10</span>) <span class="hljs-comment">// &#x9019;&#x662F;&#x4E0D;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8ACB;&#x5225;&#x9019;&#x9EBC;&#x505A;&#xFF01;</span>
  fmt.Println(<span class="hljs-string">&quot;done&quot;</span>)
}

<span class="hljs-keyword">func</span> process() {
  fmt.Println(<span class="hljs-string">&quot;processing&quot;</span>)
}</code></pre>
<p>&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x6709;&#x5E7E;&#x500B;&#x6709;&#x8DA3;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6211;&#x5011;&#x8981;&#x4E86;&#x89E3;&#x600E;&#x9EBC;&#x555F;&#x52D5;&#x4E00;&#x500B; goroutine&#x3002;&#x6211;&#x5011;&#x53EA;&#x8981;&#x5C07; <code>go</code> &#x95DC;&#x9375;&#x5B57;&#x653E;&#x5728;&#x6211;&#x5011;&#x60F3;&#x8981;&#x57F7;&#x884C;&#x7684;&#x51FD;&#x5F0F;&#x524D;&#x9762;&#x5373;&#x53EF;&#x3002;&#x5982;&#x679C;&#x6211;&#x5011;&#x60F3;&#x8981;&#x57F7;&#x884C;&#x4E00;&#x5C0F;&#x6BB5;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x90A3;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x533F;&#x540D;&#x51FD;&#x5F0F;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x533F;&#x540D;&#x51FD;&#x5F0F;&#x4E0D;&#x50C5;&#x50C5;&#x5728; goroutine &#x4E2D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p><pre><code class="lang-go"><span class="hljs-keyword">go</span> <span class="hljs-keyword">func</span>() {
  fmt.Println(<span class="hljs-string">&quot;processing&quot;</span>)
}()</code></pre>
<p>Goroutine &#x5F88;&#x5BB9;&#x6613;&#x5EFA;&#x7ACB;&#x800C;&#x4E14;&#x958B;&#x92B7;&#x5F88;&#x5C0F;&#xFF0C;&#x6700;&#x7D42;&#x591A;&#x500B; goroutine &#x6703;&#x57F7;&#x884C;&#x5728;&#x540C;&#x4E00;&#x500B;&#x4F5C;&#x696D;&#x7CFB;&#x7D71;&#x591A;&#x500B;&#x57F7;&#x884C;&#x7DD2;&#x4E0A; (&#x8B6F;&#x6CE8;&#xFF1A;&#x53EF;&#x4EE5;&#x53C3;&#x8003; Effective Go &#x7684;&#x8AAA;&#x660E;&#xFF1A;<a href="https://golang.org/doc/effective_go.html#goroutines" target="_blank">https://golang.org/doc/effective_go.html#goroutines</a>)&#x3002;&#x9019;&#x4E5F;&#x5E38;&#x88AB;&#x7A31;&#x70BA; M:N &#x57F7;&#x884C;&#x7DD2;&#x6A21;&#x578B;&#x3002;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x6709; M &#x500B;&#x61C9;&#x7528;&#x7A0B;&#x5F0F; goroutine&#xFF0C;&#x57F7;&#x884C;&#x5728; N &#x500B;&#x4F5C;&#x696D;&#x7CFB;&#x7D71;&#x7684;&#x57F7;&#x884C;&#x7DD2;&#x3002;&#x7D50;&#x679C;&#x5C31;&#x662F;&#xFF0C;&#x4E00;&#x500B; goroutine &#x7684;&#x958B;&#x92B7;&#x6BD4;&#x8D77;&#x57F7;&#x884C;&#x7DD2;&#x4F86;&#x8AAA;&#x4F4E;&#x5F88;&#x591A;&#xFF08;&#x4E5F;&#x8A31;&#x53EA;&#x6709;&#x5E7E; KB&#xFF09;&#xFF0C;&#x5728;&#x73FE;&#x4EE3;&#x7684;&#x786C;&#x9AD4;&#x4E0A;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x53EF;&#x80FD;&#x540C;&#x6642;&#x57F7;&#x884C;&#x5E7E;&#x767E;&#x842C;&#x500B; goroutine&#x3002;</p><p>&#x6B64;&#x5916;&#xFF0C;&#x9019;&#x88E1;&#x9084;&#x96B1;&#x85CF;&#x4E86;&#x6620;&#x5C04;&#x548C;&#x8ABF;&#x5EA6;&#x7684;&#x8907;&#x96DC;&#x6027;&#x3002;&#x6211;&#x5011;&#x50C5;&#x9700;&#x8981;&#x8AAA; <em>&#x9019;&#x6BB5;&#x4EE3;&#x78BC;&#x8981;&#x4E26;&#x884C;&#x57F7;&#x884C;</em>&#xFF0C;&#x7136;&#x5F8C; Go &#x5C31;&#x6703;&#x8B93;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#x767C;&#x751F;&#x4E86;&#x3002;</p><p>&#x56DE;&#x5230;&#x6211;&#x5011;&#x525B;&#x525B;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x6703;&#x767C;&#x73FE;&#x6211;&#x5011;&#x4F7F;&#x7528; <code>Sleep</code> &#x51FD;&#x5F0F;&#x8B93;&#x7A0B;&#x5F0F;&#x66AB;&#x505C;&#x5E7E;&#x6BEB;&#x79D2;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x8981;&#x8B93; goroutine &#x5728;&#x4E3B;&#x7A0B;&#x5F0F;&#x57F7;&#x884C;&#x5B8C;&#x7D50;&#x675F;&#x524D;&#x88AB;&#x57F7;&#x884C;&#xFF08;&#x4E3B;&#x7A0B;&#x5F0F;&#x4E0D;&#x6703;&#x7B49;&#x5230;&#x6240;&#x6709; goroutine &#x57F7;&#x884C;&#x5B8C;&#x624D;&#x7D50;&#x675F;&#xFF09;&#x3002;&#x8981;&#x89E3;&#x6C7A;&#x9019;&#x500B;&#x554F;&#x984C;&#xFF0C;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x8981;&#x8B93;&#x7A0B;&#x5F0F;&#x78BC;&#x4E92;&#x76F8;&#x5354;&#x8ABF;&#x4E00;&#x4E0B;&#x3002;</p><h2 id="&#x540C;&#x6B65;">&#x540C;&#x6B65;</h2><p>&#x5EFA;&#x7ACB;&#x4E00;&#x500B; goroutine &#x6C92;&#x6709;&#x592A;&#x56F0;&#x96E3;&#xFF0C;&#x800C;&#x4E14;&#x958B;&#x92B7;&#x5F88;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5EFA;&#x7ACB;&#x5F88;&#x591A; goroutine&#x3002;&#x4F46;&#x554F;&#x984C;&#x662F;&#xFF0C;&#x4E26;&#x884C;&#x5316;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x9700;&#x8981;&#x4E92;&#x76F8;&#x6E9D;&#x901A;&#x3002;&#x8981;&#x89E3;&#x6C7A;&#x9019;&#x500B;&#x9700;&#x6C42;&#xFF0C;Go &#x63D0;&#x4F9B;&#x4E86; <code>channels</code> &#x7684;&#x6A5F;&#x5236;&#x3002;&#x5728;&#x6211;&#x5011;&#x5B78;&#x7FD2; <code>channels</code> &#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x8981;&#x5148;&#x5B78;&#x7FD2;&#x4E26;&#x884C;&#x5316;&#x7A0B;&#x5F0F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x3002;</p><p>&#x64B0;&#x5BEB;&#x4E26;&#x884C;&#x5316;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7279;&#x5225;&#x6CE8;&#x610F;&#x4F60;&#x5728;&#x54EA;&#x88E1;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8B80;&#x53D6;&#x4E00;&#x500B;&#x503C;&#x3002;&#x67D0;&#x4E9B;&#x9762;&#x5411;&#x4F86;&#x8AAA;&#xFF0C;&#x4ED6;&#x5F88;&#x50CF;&#x4F60;&#x5728;&#x64B0;&#x5BEB;&#x4E00;&#x500B;&#x6C92;&#x6709;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6A5F;&#x5236;&#x7684;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x3002;&#x5B83;&#x9700;&#x8981;&#x4F60;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x5EA6;&#x91CD;&#x65B0;&#x601D;&#x8003;&#x8CC7;&#x6599;&#xFF0C;&#x6C38;&#x9060;&#x8981;&#x8003;&#x616E;&#x53EF;&#x80FD;&#x7684;&#x5371;&#x96AA;&#x6027;&#x3002;&#x770B;&#x770B;&#x4EE5;&#x4E0B;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
  <span class="hljs-string">&quot;fmt&quot;</span>
  <span class="hljs-string">&quot;time&quot;</span>
)

<span class="hljs-keyword">var</span> counter = <span class="hljs-number">0</span>

<span class="hljs-keyword">func</span> main() {
  <span class="hljs-keyword">for</span> i := <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">20</span>; i++ {
    <span class="hljs-keyword">go</span> incr()
  }
  time.Sleep(time.Millisecond * <span class="hljs-number">10</span>)
}

<span class="hljs-keyword">func</span> incr() {
  counter++
  fmt.Println(counter)
}</code></pre>
<p>&#x4F60;&#x89BA;&#x5F97;&#x8F38;&#x51FA;&#x6703;&#x662F;&#x4EC0;&#x9EBC;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x8A8D;&#x70BA;&#x8F38;&#x5165;&#x6703;&#x662F; <code>1, 2, ... 20</code>&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x662F;&#x5C0D;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x932F;&#x7684;&#x3002;&#x7576;&#x4F60;&#x57F7;&#x884C;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x7684;&#x78BA;&#x6709;&#x6642;&#x5019;&#x6703;&#x5F97;&#x5230;&#x9019;&#x6A23;&#x7684;&#x7D50;&#x679C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E8B;&#x5BE6;&#x4E0A;&#x9019;&#x500B;&#x7D50;&#x679C;&#x662F;&#x4E0D;&#x78BA;&#x5B9A;&#x7684;&#xFF0C;&#x70BA;&#x4EC0;&#x9EBC;&#xFF1F;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x6709;&#x591A;&#x500B;&#xFF08;&#x5728;&#x9019;&#x500B;&#x4F8B;&#x5B50;&#x662F;&#x5169;&#x500B;) goroutine &#x540C;&#x6642;&#x5B58;&#x53D6;&#x55AE;&#x4E00;&#x500B;&#x8B8A;&#x6578; <code>counter</code>&#x3002;&#x6216;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x72C0;&#x6CC1;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x500B; goroutine &#x6B63;&#x5728;&#x8B80;&#x53D6;&#x9019;&#x500B;&#x8B8A;&#x6578;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x500B;&#x6B63;&#x5728;&#x5BEB;&#x5165;&#x3002;</p><p>&#x9019;&#x6A23;&#x771F;&#x7684;&#x5371;&#x96AA;&#x55CE;&#xFF1F;&#x7684;&#x78BA;&#x662F;&#x7684;&#x3002;<code>counter++</code> &#x770B;&#x8D77;&#x4F86;&#x53EA;&#x662F;&#x4E00;&#x884C;&#x7C21;&#x55AE;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x4F46;&#x5B83;&#x5BE6;&#x969B;&#x4E0A;&#x88AB;&#x62C6;&#x89E3;&#x6210;&#x6578;&#x884C;&#x7684;&#x7D44;&#x5408;&#x8A9E;&#x8A00;&#xFF0C;&#x5BE6;&#x969B;&#x7684;&#x72C0;&#x6CC1;&#x6703;&#x53D6;&#x6C7A;&#x65BC;&#x4F60;&#x57F7;&#x884C;&#x8A72;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x8EDF;&#x786C;&#x9AD4;&#x5E73;&#x53F0;&#x3002;&#x5982;&#x679C;&#x4F60;&#x57F7;&#x884C;&#x9019;&#x500B;&#x7BC4;&#x4F8B;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x6CC1;&#x662F;&#x6578;&#x5B57;&#x5370;&#x51FA;&#x7684;&#x9806;&#x5E8F;&#x662F;&#x4E0D;&#x56FA;&#x5B9A;&#x7684;&#x3002;&#x6216;&#x6709;&#x53EF;&#x80FD;&#x67D0;&#x4E9B;&#x6578;&#x5B57;&#x91CD;&#x8907;&#x6216;&#x907A;&#x5931;&#x3002;&#x6700;&#x58DE;&#x7684;&#x7D50;&#x679C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x7A0B;&#x5F0F;&#x932F;&#x8AA4;&#x6216;&#x662F;&#x5F97;&#x5230;&#x4EFB;&#x610F;&#x7684;&#x503C;&#x3002;</p><p>&#x5728;&#x4E26;&#x884C;&#x5316;&#x7684;&#x7A0B;&#x5F0F;&#x4E2D;&#xFF0C;&#x552F;&#x4E00;&#x5B89;&#x5168;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x8B80;&#x53D6;&#x8A72;&#x8B8A;&#x6578;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x7A0B;&#x5F0F;&#x53BB;&#x8B80;&#x4E00;&#x500B;&#x8B8A;&#x6578;&#xFF0C;&#x4F46;&#x5BEB;&#x5165;&#x8B8A;&#x6578;&#x5FC5;&#x9808;&#x662F;&#x540C;&#x6B65;&#x7684;&#x3002;&#x9019;&#x6709;&#x5E7E;&#x7A2E;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5BE6;&#x73FE;&#xFF0C;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x4F9D;&#x8CF4;&#x65BC; CPU &#x67B6;&#x69CB;&#x7684;&#x539F;&#x5B50;&#x5316;&#x64CD;&#x4F5C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5927;&#x591A;&#x6578;&#x7684;&#x5F62;&#x6CC1;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x500B;&#x4E92;&#x65A5;&#x9396;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
  <span class="hljs-string">&quot;fmt&quot;</span>
  <span class="hljs-string">&quot;time&quot;</span>
  <span class="hljs-string">&quot;sync&quot;</span>
)

<span class="hljs-keyword">var</span> (
  counter = <span class="hljs-number">0</span>
  lock sync.Mutex
)

<span class="hljs-keyword">func</span> main() {
  <span class="hljs-keyword">for</span> i := <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">20</span>; i++ {
    <span class="hljs-keyword">go</span> incr()
  }
  time.Sleep(time.Millisecond * <span class="hljs-number">10</span>)
}

<span class="hljs-keyword">func</span> incr() {
  lock.Lock()
  <span class="hljs-keyword">defer</span> lock.Unlock()
  counter++
  fmt.Println(counter)
}</code></pre>
<p>&#x4E92;&#x65A5;&#x9396;&#x53EF;&#x4EE5;&#x8B93;&#x4F60;&#x5FAA;&#x5E8F;&#x7684;&#x5B58;&#x53D6;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;&#x56E0;&#x70BA;&#x9810;&#x8A2D;&#x7684; <code>sync.Mutex</code> &#x662F;&#x6C92;&#x6709;&#x9396;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5011;&#x7C21;&#x55AE;&#x7684;&#x5B9A;&#x7FA9;&#x4E86;&#x4E00;&#x500B; <code>lock sync.Mutex</code>&#x3002;</p><p>&#x770B;&#x8D77;&#x4F86;&#x4F3C;&#x4E4E;&#x5F88;&#x7C21;&#x55AE;&#xFF1F;&#x5176;&#x5BE6;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6709;&#x4E00;&#x9EDE;&#x6B3A;&#x9A19;&#x7684;&#x610F;&#x5473;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x54EA;&#x4E9B;&#x7A0B;&#x5F0F;&#x78BC;&#x9700;&#x8981;&#x88AB;&#x4FDD;&#x8B77;&#x5176;&#x5BE6;&#x4E26;&#x4E0D;&#x662F;&#x5F88;&#x660E;&#x986F;&#x7684;&#x3002;&#x96D6;&#x7136;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x500B;&#x4F4E;&#x7B49;&#x7684;&#x9396;&#xFF08;&#x9019;&#x500B;&#x9396;&#x5305;&#x542B;&#x4E86;&#x8A31;&#x591A;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF09;&#xFF0C;&#x9019;&#x4E9B;&#x6F5B;&#x5728;&#x5BB9;&#x6613;&#x51FA;&#x932F;&#x7684;&#x90E8;&#x5206;&#x662F;&#x6211;&#x5011;&#x5728;&#x64B0;&#x5BEB;&#x4E26;&#x884C;&#x5316;&#x7A0B;&#x5F0F;&#x78BC;&#x9996;&#x5148;&#x8981;&#x8003;&#x616E;&#x7684;&#x3002;&#x6211;&#x5011;&#x901A;&#x5E38;&#x60F3;&#x8981;&#x4E00;&#x500B;&#x5F88;&#x7CBE;&#x78BA;&#x7684;&#x9396;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x5011;&#x7D93;&#x5E38;&#x6703;&#x767C;&#x73FE;&#x672C;&#x4F86;&#x662F;&#x958B;&#x5728;&#x4E00;&#x500B;&#x5341;&#x7DDA;&#x9053;&#x7684;&#xFF0C;&#x7A81;&#x7136;&#x8F49;&#x5F80;&#x4E00;&#x500B;&#x55AE;&#x7DDA;&#x9053;&#x4E00;&#x6A23;&#x3002;</p><p>&#x53E6;&#x5916;&#x4E00;&#x500B;&#x554F;&#x984C;&#x662F;&#x6B7B;&#x9396;&#x554F;&#x984C;&#x3002;&#x7576;&#x6211;&#x5011;&#x4F7F;&#x7528;&#x4E00;&#x500B;&#x9396;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6C92;&#x6709;&#x554F;&#x984C;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x5169;&#x500B;&#x6216;&#x5169;&#x500B;&#x4EE5;&#x4E0A;&#x7684;&#x9396;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x767C;&#x751F;&#x4E00;&#x7A2E;&#x554F;&#x984C;&#x662F;&#xFF0C;&#x7576; goroutineA &#x6709;&#x9396; A&#xFF0C;&#x4F46;&#x4ED6;&#x60F3;&#x8981;&#x5B58;&#x53D6;&#x9396; B&#xFF0C;&#x800C; goroutineB &#x64C1;&#x6709;&#x9396; B&#xFF0C;&#x4F46;&#x5B83;&#x60F3;&#x8981;&#x5B58;&#x53D6;&#x9396; A&#x3002;</p><p>&#x4E8B;&#x5BE6;&#x4E0A;&#x7576;&#x6211;&#x5011;&#x4F7F;&#x7528;&#x4E00;&#x500B;&#x9396;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x5FD8;&#x4E86;&#x91CB;&#x653E;&#x5B83;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x767C;&#x751F;&#x6B7B;&#x9396;&#x554F;&#x984C;&#x3002;&#x4F46;&#x9019;&#x548C;&#x591A;&#x500B;&#x9396;&#x5F15;&#x8D77;&#x7684;&#x6B7B;&#x9396;&#x554F;&#x984C;&#x76F8;&#x6BD4;&#xFF0C;&#x4E26;&#x4E0D;&#x56B4;&#x91CD;&#xFF08;&#x4E8B;&#x5BE6;&#x4E0A;&#x9019;&#x4E5F;&#x5F88;&#x96E3;&#x767C;&#x73FE;&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8A66;&#x8457;&#x57F7;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
  <span class="hljs-string">&quot;time&quot;</span>
  <span class="hljs-string">&quot;sync&quot;</span>
)

<span class="hljs-keyword">var</span> (
  lock sync.Mutex
)

<span class="hljs-keyword">func</span> main() {
  <span class="hljs-keyword">go</span> <span class="hljs-keyword">func</span>() { lock.Lock() }()
  time.Sleep(time.Millisecond * <span class="hljs-number">10</span>)
  lock.Lock()
}</code></pre>
<p>&#x6211;&#x5011;&#x5230;&#x76EE;&#x524D;&#x70BA;&#x6B62;&#x9084;&#x6709;&#x5F88;&#x591A;&#x4E26;&#x884C;&#x7A0B;&#x5F0F;&#x6C92;&#x6709;&#x770B;&#x904E;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6709;&#x4E00;&#x500B;&#x5E38;&#x898B;&#x7684;&#x9396;&#x53EB;&#x505A;&#x300C;&#x8B80;&#x5BEB;&#x9396;&#x300D;&#x3002;&#x9019;&#x500B;&#x9396;&#x63D0;&#x4F9B;&#x5169;&#x500B;&#x529F;&#x80FD;&#xFF1A;&#x4E00;&#x500B;&#x9396;&#x5B9A;&#x8B80;&#x3001;&#x53E6;&#x4E00;&#x500B;&#x9396;&#x5B9A;&#x5BEB;&#x3002;&#x9019;&#x500B;&#x529F;&#x80FD;&#x8B93;&#x4F60;&#x53EF;&#x4EE5;&#x540C;&#x6642;&#x6709;&#x591A;&#x500B;&#x8B80;&#x5BEB;&#x64CD;&#x4F5C;&#x3002;&#x5728; Go &#x4E2D;&#xFF0C;<code>sync.RWMutex</code> &#x5C31;&#x662F;&#x9019;&#x6A23;&#x7684;&#x529F;&#x7528;&#x3002;&#x53E6;&#x5916;&#xFF0C;<code>sync.Mutex</code> &#x9664;&#x4E86;&#x63D0;&#x4F9B; <code>Lock</code> &#x548C; <code>Unlock</code> &#x5916;&#xFF0C;&#x5B83;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86; <code>RLock</code> &#x548C; <code>RUnlock</code>&#xFF0C;&#x9019;&#x500B; <code>R</code> &#x4EE3;&#x8868;&#x4E86;<em>&#x8B80;&#x53D6;</em>&#x3002;&#x96D6;&#x7136;&#x8B80;&#x5BEB;&#x9396;&#x5F88;&#x5E38;&#x7528;&#xFF0C;&#x4F46;&#x4ED6;&#x5011;&#x4E5F;&#x6703;&#x7D66;&#x958B;&#x767C;&#x8005;&#x5E36;&#x4F86;&#x984D;&#x5916;&#x7684;&#x8CA0;&#x64D4;&#xFF1A;&#x6211;&#x5011;&#x4E0D;&#x50C5;&#x8981;&#x6CE8;&#x610F;&#x6211;&#x5011;&#x6B63;&#x5728;&#x5B58;&#x53D6;&#x7684;&#x8CC7;&#x6599;&#xFF0C;&#x4E5F;&#x8981;&#x6CE8;&#x610F;&#x662F;&#x5982;&#x4F55;&#x5B58;&#x53D6;&#x7684;&#x3002;</p><p>&#x6B64;&#x5916;&#xFF0C;&#x90E8;&#x5206;&#x7684;&#x4E26;&#x884C;&#x5316;&#x7A0B;&#x5F0F;&#x4E0D;&#x50C5;&#x50C5;&#x662F;&#x5FAA;&#x5E8F;&#x7684;&#x5B58;&#x53D6;&#x8B8A;&#x6578;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x5B89;&#x6392;&#x591A;&#x500B; goroutine&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7B49;&#x5F85; 10 &#x6BEB;&#x79D2;&#x4E26;&#x4E0D;&#x662F;&#x4E00;&#x500B;&#x512A;&#x96C5;&#x7684;&#x89E3;&#x6C7A;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x500B; goroutine &#x9700;&#x8981;&#x8D85;&#x904E; 10 &#x6BEB;&#x79D2;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x57F7;&#x884C;&#x6642;&#x9593;&#x5C11;&#x65BC; 10 &#x6BEB;&#x79D2;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x662F;&#x6D6A;&#x8CBB;&#x6642;&#x9593;&#x5462;&#xFF1F;&#x53C8;&#x6216;&#x8005;&#x7576;&#x4E00;&#x500B; goroutine &#x57F7;&#x884C;&#x5B8C;&#x7562;&#x5F8C;&#xFF0C;&#x6211;&#x5011;&#x8981;&#x544A;&#x8A34;&#x53E6;&#x5916;&#x4E00;&#x500B; goroutine &#x6709;&#x65B0;&#x7684;&#x8CC7;&#x6599;&#x8981;&#x7D66;&#x8655;&#x7406;&#xFF1F;</p><p>&#x6240;&#x6709;&#x7684;&#x9019;&#x4E9B;&#x4E8B;&#x5728;&#x6C92;&#x6709; <code>channel</code> &#x7684;&#x60C5;&#x6CC1;&#x90FD;&#x53EF;&#x4EE5;&#x5BE6;&#x73FE;&#xFF0C; &#x7576;&#x7136;&#x5C0D;&#x65BC;&#x66F4;&#x7C21;&#x55AE;&#x7684;&#x4F8B;&#x5B50;&#x4F86;&#x8AAA;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4F60;&#x61C9;&#x8A72;&#x4F7F;&#x7528; <code>sync.Mutex</code> &#x548C; <code>sync.RWMutex</code>&#x3002;
&#x4F46;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x7BC0;&#x4E2D;&#xFF0C;&#x6211;&#x5011;&#x5C07;&#x6703;&#x5B78;&#x7FD2;&#x5230; <code>channel</code> &#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x70BA;&#x4E86;&#x8B93;&#x4E26;&#x884C;&#x7A0B;&#x5F0F;&#x78BC;&#x5728;&#x64B0;&#x5BEB;&#x6642;&#x66F4;&#x7C21;&#x55AE;&#x4E14;&#x66F4;&#x4E0D;&#x5BB9;&#x6613;&#x51FA;&#x932F;&#x3002;</p><h2 id="channel">Channel</h2><p>&#x64B0;&#x5BEB;&#x4E26;&#x884C;&#x5316;&#x7A0B;&#x5F0F;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x6311;&#x6230;&#x5728;&#x65BC;&#x8CC7;&#x6599;&#x5171;&#x4EAB;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684; Go &#x7A0B;&#x5F0F;&#x6C92;&#x6709;&#x8981;&#x5171;&#x4EAB;&#x8CC7;&#x6599;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x64D4;&#x5FC3;&#x540C;&#x6B65;&#x7684;&#x554F;&#x984C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5C0D;&#x8207;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x7CFB;&#x7D71;&#x800C;&#x8A00;&#xFF0C;&#x9019;&#x4E26;&#x4E0D;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x64D4;&#x5FC3;&#x7684;&#x3002;&#x4E8B;&#x5BE6;&#x4E0A;&#xFF0C;&#x8A31;&#x591A;&#x7CFB;&#x7D71;&#x53CD;&#x800C;&#x671D;&#x5411;&#x53CD;&#x65B9;&#x5411;&#x8A2D;&#x8A08;&#xFF1A;&#x5728;&#x591A;&#x500B;&#x8ACB;&#x6C42;&#x4E4B;&#x9593;&#x5206;&#x4EAB;&#x8CC7;&#x6599;&#x3002;&#x6240;&#x6709;&#x7684;&#x8A18;&#x61B6;&#x9AD4;&#x5FEB;&#x53D6;&#x6216;&#x8CC7;&#x6599;&#x5EAB;&#x8A2D;&#x8A08;&#x90FD;&#x662F;&#x6700;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x9019;&#x5DF2;&#x7D93;&#x8B8A;&#x6210;&#x8D8A;&#x4F86;&#x8D8A;&#x6D41;&#x884C;&#x7684;&#x73FE;&#x5BE6;&#x4E86;&#x3002;</p><p>Channel &#x8B93;&#x4E26;&#x884C;&#x5316;&#x7A0B;&#x5F0F;&#x8A2D;&#x8A08;&#x5728;&#x5171;&#x4EAB;&#x8CC7;&#x6599;&#x4E0A;&#x66F4;&#x6709;&#x9053;&#x7406;&#x3002;&#x4E00;&#x500B; Channel &#x5C31;&#x662F;&#x4E0D;&#x540C;&#x7684; goroutine &#x4E4B;&#x9593;&#x7528;&#x4F86;&#x50B3;&#x905E;&#x8CC7;&#x6599;&#x6E9D;&#x901A;&#x7684;&#x7BA1;&#x9053;&#x3002;&#x63DB;&#x53E5;&#x8A71;&#x8AAA;&#xFF0C;&#x4E00;&#x500B; goroutine &#x53EF;&#x4EE5;&#x85C9;&#x7531; Channel &#x4F86;&#x50B3;&#x905E;&#x8CC7;&#x6599;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x500B; goroutine&#x3002;&#x5176;&#x7D50;&#x679C;&#x5C31;&#x662F;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x6642;&#x9593;&#x5167;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x500B; goroutine &#x6703;&#x5B58;&#x53D6;&#x5230;&#x8CC7;&#x6599;&#x3002;</p><p>Channel &#x4E00;&#x6A23;&#x6709;&#x578B;&#x5225;&#x3002;&#x5B83;&#x7684;&#x578B;&#x5225;&#x5C31;&#x662F;&#x6211;&#x5011;&#x8981;&#x5728;&#x4E0D;&#x540C; goroutine &#x4E4B;&#x9593;&#x50B3;&#x905E;&#x8CC7;&#x6599;&#x7684;&#x578B;&#x5225;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x500B;&#x7528;&#x4F86;&#x50B3;&#x905E;&#x6574;&#x6578;&#x7684; Channel&#xFF1A;</p><pre><code class="lang-go">c := <span class="hljs-built_in">make</span>(<span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>)</code></pre>
<p>&#x9019;&#x7A2E;&#x578B;&#x5225;&#x7684; channel &#x5C31;&#x662F; <code>chan int</code>&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x70BA;&#x4E86;&#x8981;&#x900F;&#x904E;&#x51FD;&#x5F0F;&#x50B3;&#x905E;&#x9019;&#x6A23;&#x7684; channel&#xFF0C;&#x4ED6;&#x7684;&#x53C3;&#x6578;&#x6703;&#x662F;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> worker(c <span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>) { ... }</code></pre>
<p>Channel &#x652F;&#x6301;&#x5169;&#x7A2E;&#x64CD;&#x4F5C;&#xFF1A;&#x63A5;&#x6536;&#x548C;&#x50B3;&#x9001;&#x3002;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x9019;&#x6A23;&#x50B3;&#x9001;&#x8CC7;&#x6599;&#x5230;&#x4E00;&#x500B; channel&#xFF1A;</p><pre><code>CHANNEL &lt;- DATA</code></pre>
<p>&#x6216;&#x662F;&#x5F9E; channel &#x63A5;&#x6536;&#x8CC7;&#x6599;&#xFF1A;</p><pre><code>VAR := &lt;-CHANNEL</code></pre>
<p>&#x7BAD;&#x982D;&#x4EE3;&#x8868;&#x4E86;&#x8CC7;&#x6599;&#x50B3;&#x905E;&#x7684;&#x65B9;&#x5411;&#x3002;&#x7576;&#x50B3;&#x9001;&#x8CC7;&#x6599;&#x6642;&#xFF0C;&#x7BAD;&#x982D;&#x662F;&#x6307;&#x5411; channel &#x7684;&#x3002;&#x7576;&#x63A5;&#x6536;&#x8CC7;&#x6599;&#x6642;&#xFF0C;&#x7BAD;&#x982D;&#x662F;&#x5F9E; channel &#x6307;&#x51FA;&#x53BB;&#x7684;&#x3002;</p><p>&#x5728;&#x6211;&#x5011;&#x5B78;&#x7FD2;&#x7B2C;&#x4E00;&#x500B;&#x4F8B;&#x5B50;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5011;&#x8981;&#x77E5;&#x9053;&#x6700;&#x5F8C;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x5F9E; channel &#x63A5;&#x6536;&#x6216;&#x50B3;&#x9001;&#x51FA;&#x53BB;&#x662F;&#x4E92;&#x76F8;&#x963B;&#x585E;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8AAA;&#xFF0C;&#x7576;&#x6211;&#x5011;&#x5F9E;&#x4E00;&#x500B; channel &#x63A5;&#x6536;&#x8CC7;&#x6599;&#x6642;&#xFF0C;goroutine &#x6703;&#x7B49;&#x5230;&#x8CC7;&#x6599;&#x63A5;&#x6536;&#x5B8C;&#x7562;&#x5F8C;&#x624D;&#x6703;&#x7E7C;&#x7E8C;&#x57F7;&#x884C;&#x3002;&#x540C;&#x6A23;&#x7684;&#xFF0C;&#x7576;&#x6211;&#x5011;&#x50B3;&#x9001;&#x8CC7;&#x6599;&#x5230;&#x4E00;&#x500B; channel &#x6642;&#xFF0C;&#x5728;&#x8CC7;&#x6599;&#x88AB;&#x63A5;&#x6536;&#x4E4B;&#x524D;&#xFF0C;goroutine &#x4E5F;&#x4E0D;&#x6703;&#x7E7C;&#x7E8C;&#x57F7;&#x884C;&#x3002;</p><p>&#x8003;&#x91CF;&#x5230;&#x4E00;&#x500B;&#x7CFB;&#x7D71;&#x6703;&#x9700;&#x8981;&#x5728;&#x4E0D;&#x540C;&#x7684; goroutine &#x4F86;&#x8655;&#x7406;&#x63A5;&#x6536;&#x5230;&#x7684;&#x8CC7;&#x6599;&#xFF0C;&#x9019;&#x662F;&#x4E00;&#x500B;&#x76F8;&#x7576;&#x5E38;&#x898B;&#x7684;&#x9700;&#x6C42;&#x3002;&#x5982;&#x679C;&#x6211;&#x5011;&#x5728; goroutine &#x91DD;&#x5C0D;&#x63A5;&#x6536;&#x5230;&#x7684;&#x8CC7;&#x6599;&#x9032;&#x884C;&#x8907;&#x96DC;&#x7684;&#x8655;&#x7406;&#xFF0C;&#x90A3;&#x5BA2;&#x6236;&#x7AEF;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x6703;&#x8D85;&#x6642;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x5011;&#x64B0;&#x5BEB;&#x6211;&#x5011;&#x7684; worker&#xFF0C;&#x9019;&#x662F;&#x4E00;&#x500B;&#x7C21;&#x55AE;&#x7684;&#x51FD;&#x5F0F;&#xFF0C;&#x4F46;&#x6211;&#x5011;&#x6703;&#x628A;&#x5B83;&#x8B8A;&#x6210;&#x7D50;&#x69CB;&#x7684;&#x4E00;&#x90E8;&#x4EFD;&#xFF0C;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x4E4B;&#x524D;&#x9084;&#x6C92;&#x6709;&#x9019;&#x6A23;&#x4F7F;&#x7528;&#x904E; goroutine&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">type</span> Worker <span class="hljs-keyword">struct</span> {
  id <span class="hljs-keyword">int</span>
}

<span class="hljs-keyword">func</span> (w Worker) process(c <span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>) {
  <span class="hljs-keyword">for</span> {
    data := &lt;-c
    fmt.Printf(<span class="hljs-string">&quot;worker %d got %d\n&quot;</span>, w.id, data)
  }
}</code></pre>
<p>&#x6211;&#x5011;&#x7684; worker &#x5F88;&#x7C21;&#x55AE;&#xFF0C;&#x4ED6;&#x7B49;&#x5230;&#x6240;&#x6709;&#x7684;&#x8CC7;&#x6599;&#x90FD;&#x63A5;&#x6536;&#x5230;&#x4E86;&#x4E4B;&#x5F8C;&#x624D;&#x8655;&#x7406;&#x4ED6;&#x5011;&#x3002;&#x9019;&#x500B; worker &#x76E1;&#x8CAC;&#x7684;&#x5728;&#x4E00;&#x500B;&#x7121;&#x7AAE;&#x8FF4;&#x5708;&#x4E2D;&#x4E0D;&#x65B7;&#x7684;&#x7B49;&#x5F85;&#x66F4;&#x591A;&#x8CC7;&#x6599;&#xFF0C;&#x7136;&#x5F8C;&#x8655;&#x7406;&#x4ED6;&#x5011;&#x3002;</p><p>&#x70BA;&#x4E86;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x8981;&#x555F;&#x52D5;&#x4E00;&#x4E9B; workers&#xFF1A;</p><pre><code class="lang-go">c := <span class="hljs-built_in">make</span>(<span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>)
<span class="hljs-keyword">for</span> i := <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">5</span>; i++ {
  worker := &amp;Worker{id: i}
  <span class="hljs-keyword">go</span> worker.process(c)
}</code></pre>
<p>&#x63A5;&#x8457;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x6307;&#x6D3E;&#x7D66;&#x4ED6;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">for</span> {
  c &lt;- rand.Int()
  time.Sleep(time.Millisecond * <span class="hljs-number">50</span>)
}</code></pre>
<p>&#x4E0B;&#x9762;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x7BC4;&#x4F8B;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
  <span class="hljs-string">&quot;fmt&quot;</span>
  <span class="hljs-string">&quot;time&quot;</span>
  <span class="hljs-string">&quot;math/rand&quot;</span>
)

<span class="hljs-keyword">func</span> main() {
  c := <span class="hljs-built_in">make</span>(<span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>)
  <span class="hljs-keyword">for</span> i := <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">5</span>; i++ {
    worker := &amp;Worker{id: i}
    <span class="hljs-keyword">go</span> worker.process(c)
  }

  <span class="hljs-keyword">for</span> {
    c &lt;- rand.Int()
    time.Sleep(time.Millisecond * <span class="hljs-number">50</span>)
  }
}

<span class="hljs-keyword">type</span> Worker <span class="hljs-keyword">struct</span> {
  id <span class="hljs-keyword">int</span>
}

<span class="hljs-keyword">func</span> (w *Worker) process(c <span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>) {
  <span class="hljs-keyword">for</span> {
    data := &lt;-c
    fmt.Printf(<span class="hljs-string">&quot;worker %d got %d\n&quot;</span>, w.id, data)
  }
}</code></pre>
<p>&#x6211;&#x5011;&#x4E26;&#x4E0D;&#x77E5;&#x9053;&#x54EA;&#x4E00;&#x500B; worker &#x6703;&#x6536;&#x5230;&#x8CC7;&#x6599;&#x3002;&#x6211;&#x5011;&#x77E5;&#x9053;&#x7684;&#x662F;&#xFF0C;Go &#x6703;&#x78BA;&#x4FDD;&#x6211;&#x5011;&#x9001;&#x7D66; channel &#x7684;&#x8CC7;&#x6599;&#x53EA;&#x6703;&#x6709;&#x4E00;&#x500B;&#x63A5;&#x6536;&#x8005;&#x63A5;&#x6536;&#x3002;</p><p>&#x8981;&#x7279;&#x5225;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;channel &#x662F;&#x552F;&#x4E00;&#x5B89;&#x5168;&#x7528;&#x4F86;&#x63A5;&#x6536;&#x548C;&#x50B3;&#x9001;&#x5171;&#x4EAB;&#x8CC7;&#x6599;&#x7684;&#x65B9;&#x5F0F;&#x3002;Channel &#x63D0;&#x4F9B;&#x4E86;&#x6240;&#x6709;&#x6211;&#x5011;&#x5728;&#x540C;&#x6B65;&#x7A0B;&#x5F0F;&#x78BC;&#x6240;&#x9700;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E26;&#x4E14;&#x78BA;&#x4FDD;&#x5728;&#x540C;&#x4E00;&#x6642;&#x9593;&#x53EA;&#x6703;&#x6709;&#x4E00;&#x500B; goroutine &#x53EF;&#x4EE5;&#x5B58;&#x53D6;&#x7279;&#x5B9A;&#x7684;&#x8CC7;&#x6599;&#x3002;</p><h3 id="&#x5177;&#x6709;&#x66AB;&#x5B58;&#x80FD;&#x529B;&#x7684;-channel">&#x5177;&#x6709;&#x66AB;&#x5B58;&#x80FD;&#x529B;&#x7684; Channel</h3><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5F0F;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x8CC7;&#x6599;&#x8D85;&#x904E;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x8655;&#x7406;&#x7684;&#x5BB9;&#x91CF;&#x6703;&#x600E;&#x6A23;&#x5462;&#xFF1F;&#x4F60;&#x53EF;&#x4EE5;&#x5617;&#x8A66;&#x6A21;&#x64EC;&#x9019;&#x7A2E;&#x72C0;&#x6CC1;&#xFF0C;&#x5728; worker &#x63A5;&#x6536;&#x5230;&#x8CC7;&#x6599;&#x5F8C;&#xFF0C;&#x8B93; worker &#x57F7;&#x884C; sleep &#x51FD;&#x5F0F;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">for</span> {
  data := &lt;-c
  fmt.Printf(<span class="hljs-string">&quot;worker %d got %d\n&quot;</span>, w.id, data)
  time.Sleep(time.Millisecond * <span class="hljs-number">500</span>)
}</code></pre>
<p>&#x5728; main &#x7A0B;&#x5F0F;&#x4E2D;&#x6703;&#x767C;&#x751F;&#x4EC0;&#x9EBC;&#x4E8B;&#xFF1F;&#x63A5;&#x6536;&#x4F7F;&#x7528;&#x8005;&#x8F38;&#x5165;&#x7684;&#x8CC7;&#x6599;&#xFF08;&#x5728;&#x9019;&#x88E1;&#x6307;&#x7684;&#x662F;&#x96A8;&#x6A5F;&#x4E82;&#x6578;&#x7522;&#x751F;&#x5668;&#xFF09;&#x6703;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x56E0;&#x70BA;&#x5F80; channel &#x767C;&#x9001;&#x8CC7;&#x6599;&#x6642;&#x4E26;&#x6C92;&#x6709;&#x63A5;&#x6536;&#x8005;&#x3002;</p><p>&#x70BA;&#x4E86;&#x78BA;&#x4FDD;&#x8CC7;&#x6599;&#x80FD;&#x5920;&#x88AB;&#x8655;&#x7406;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x8B93;&#x5BA2;&#x6236;&#x7AEF;&#x88AB;&#x5835;&#x585E;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x4F60;&#x4E5F;&#x8A31;&#x4E0D;&#x9858;&#x610F;&#x78BA;&#x4FDD;&#x8CC7;&#x6599;&#x80FD;&#x5920;&#x88AB;&#x8655;&#x7406;&#x3002;&#x9019;&#x88E1;&#x6709;&#x4E00;&#x4E9B;&#x5E38;&#x898B;&#x7684;&#x7B56;&#x7565;&#x4F86;&#x89E3;&#x6C7A;&#x9019;&#x500B;&#x554F;&#x984C;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x5C07;&#x8CC7;&#x6599;&#x66AB;&#x5B58;&#x8D77;&#x4F86;&#xFF0C;&#x5982;&#x679C;&#x6C92;&#x6709; worker &#x53EF;&#x7528;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5C07;&#x8CC7;&#x6599;&#x5148;&#x5B58;&#x5728;&#x4E00;&#x500B;&#x6709;&#x5E8F;&#x7684;&#x4F47;&#x5217;&#x4E2D;&#x3002;Channel &#x64C1;&#x6709;&#x9019;&#x7A2E;&#x5167;&#x5EFA;&#x7684;&#x66AB;&#x5B58;&#x80FD;&#x529B;&#xFF0C;&#x7576;&#x6211;&#x5011;&#x4F7F;&#x7528; <code>make</code> &#x5EFA;&#x7ACB; channel &#x6642;&#xFF0C;&#x53EF;&#x4EE5;&#x7D66;&#x5B9A;&#x5B83;&#x7684;&#x9577;&#x5EA6;&#xFF1A;</p><pre><code class="lang-go">c := <span class="hljs-built_in">make</span>(<span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>, <span class="hljs-number">100</span>)</code></pre>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x9019;&#x6A23;&#x8ABF;&#x6574;&#xFF0C;&#x4F46;&#x4F60;&#x6703;&#x767C;&#x73FE;&#x9019;&#x500B;&#x904E;&#x7A0B;&#x9084;&#x662F;&#x883B;&#x4E0D;&#x7A69;&#x5B9A;&#x7684;&#x3002;&#x4F5C;&#x70BA;&#x66AB;&#x5B58;&#x7684; channel &#x4E0D;&#x80FD;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x5BB9;&#x91CF;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x500B;&#x4F47;&#x5217;&#x4F86;&#x8655;&#x7406;&#x9019;&#x7A2E;&#x7A81;&#x7136;&#x5287;&#x589E;&#x7684;&#x8CC7;&#x6599;&#x3002;
&#x5728;&#x6211;&#x5011;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x4E0D;&#x65B7;&#x5730;&#x767C;&#x9001;&#x8CC7;&#x6599;&#xFF0C;&#x800C;&#x4E14; worker &#x4E5F;&#x53EF;&#x4EE5;&#x8655;&#x7406;&#x9019;&#x4E9B;&#x8CC7;&#x6599;&#x3002;&#x96D6;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x900F;&#x904E; channel &#x7684; <code>len</code> &#x51FD;&#x5F0F;&#x4F86;&#x4E86;&#x89E3;&#x5177;&#x6709;&#x66AB;&#x5B58;&#x529F;&#x80FD;&#x7684; channel &#x5BE6;&#x969B;&#x7684;&#x4F5C;&#x7528;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">for</span> {
  c &lt;- rand.Int()
  fmt.Println(<span class="hljs-built_in">len</span>(c))
  time.Sleep(time.Millisecond * <span class="hljs-number">50</span>)
}</code></pre>
<p>&#x4F60;&#x6703;&#x770B;&#x5230;&#x5177;&#x6709;&#x66AB;&#x5B58;&#x7684; channel &#x7684;&#x9577;&#x5EA6;&#x4E0D;&#x65B7;&#x589E;&#x52A0;&#xFF0C;&#x76F4;&#x5230;&#x8CC7;&#x6599;&#x88DD;&#x6EFF;&#x70BA;&#x6B62;&#x3002;&#x6B64;&#x6642;&#xFF0C;&#x5F80; channel &#x767C;&#x9001;&#x7684;&#x8CC7;&#x6599;&#x53C8;&#x6703;&#x88AB;&#x963B;&#x585E;&#x3002;</p><h3 id="select">Select</h3><p>&#x5373;&#x4F7F;&#x6709;&#x4E86;&#x66AB;&#x5B58;&#x6A5F;&#x5236;&#xFF0C;&#x6211;&#x5011;&#x9084;&#x662F;&#x9700;&#x8981;&#x958B;&#x59CB;&#x4E1F;&#x68C4;&#x6389;&#x4E00;&#x4E9B;&#x8CC7;&#x6599;&#x3002;&#x6211;&#x5011;&#x4E0D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x4E00;&#x500B;&#x7121;&#x9650;&#x5927;&#x7684;&#x8A18;&#x61B6;&#x9AD4;&#xFF0C;&#x4E26;&#x6307;&#x671B;&#x900F;&#x904E;&#x4EBA;&#x5DE5;&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x91CB;&#x653E;&#x3002;
&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x5011;&#x8981;&#x4F7F;&#x7528; Go &#x7684; <code>select</code>&#x3002;</p><p>&#x8A9E;&#x6CD5;&#x4E0A;&#xFF0C;<code>select</code> &#x985E;&#x4F3C;&#x65BC; switch&#xFF0C;&#x900F;&#x904E; <code>select</code>&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x64B0;&#x5BEB;&#x4E00;&#x4E9B;&#x5728; channel &#x4E0B;&#x7121;&#x6CD5;&#x5BE6;&#x73FE;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x8B93;&#x6211;&#x5011;&#x79FB;&#x9664;&#x6211;&#x5011; channel &#x7684;&#x66AB;&#x5B58;&#xFF0C;&#x8B93;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x66F4;&#x6E05;&#x695A;&#x5730;&#x770B;&#x5230; <code>select</code> &#x662F;&#x5982;&#x4F55;&#x904B;&#x4F5C;&#x7684;&#xFF1A;</p><pre><code class="lang-go">c := <span class="hljs-built_in">make</span>(<span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>)</code></pre>
<p>&#x63A5;&#x4E0B;&#x4F86;&#xFF0C;&#x6211;&#x5011;&#x4FEE;&#x6539; <code>for</code> &#x8FF4;&#x5708;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">for</span> {
  <span class="hljs-keyword">select</span> {
  <span class="hljs-keyword">case</span> c &lt;- rand.Int():
    <span class="hljs-comment">//&#x4EE5;&#x4E0B;&#x662F;&#x53EF;&#x9078;&#x7684;&#x90E8;&#x5206;</span>
  <span class="hljs-keyword">default</span>:
    <span class="hljs-comment">//&#x9019;&#x88E1;&#x53EF;&#x4EE5;&#x7559;&#x7A7A;&#xFF0C;&#x7528;&#x4F86;&#x4E1F;&#x6389;&#x8CC7;&#x6599;</span>
    fmt.Println(<span class="hljs-string">&quot;dropped&quot;</span>)
  }
  time.Sleep(time.Millisecond * <span class="hljs-number">50</span>)
}</code></pre>
<p>&#x6211;&#x5011;&#x6BCF;&#x79D2;&#x5F80; channel &#x9001; 20 &#x500B;&#x8A0A;&#x606F;&#xFF0C;&#x4F46;&#x6211;&#x5011;&#x7684; worker &#x6BCF;&#x79D2;&#x53EA;&#x80FD;&#x8655;&#x7406; 10 &#x500B;&#x8A0A;&#x606F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6703;&#x6709;&#x4E00;&#x534A;&#x7684;&#x8A0A;&#x606F;&#x88AB;&#x4E1F;&#x68C4;&#x3002;</p><p>&#x9019;&#x50C5;&#x50C5;&#x662F;&#x6211;&#x5011;&#x4F7F;&#x7528; <code>select</code> &#x4F86;&#x5B8C;&#x6210;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x4F7F;&#x7528; <code>select</code> &#x7684;&#x6700;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x8B93;&#x4F60;&#x53EF;&#x4EE5;&#x7BA1;&#x7406;&#x591A;&#x500B; channel&#x3002;&#x7576;&#x4F60;&#x6709;&#x591A;&#x500B; channel &#x6642;&#xFF0C;<code>select</code> &#x6703;&#x963B;&#x64CB;&#x8CC7;&#x6599;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x4E00;&#x500B;&#x53EF;&#x7528;&#x7684; channel&#x3002;&#x5982;&#x679C;&#x6C92;&#x6709;&#x53EF;&#x7528;&#x7684; channel &#x6642;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x63D0;&#x4F9B; <code>default</code> &#x6558;&#x8FF0;&#xFF0C;&#x5C31;&#x6703;&#x8DD1;&#x5230;&#x8A72;&#x5730;&#x65B9;&#x57F7;&#x884C;&#x3002;&#x7576;&#x6709;&#x591A;&#x500B; channel &#x90FD;&#x53EF;&#x7528;&#x6642;&#xFF0C;<code>select</code> &#x6703;&#x96A8;&#x6A5F;&#x9078;&#x64C7;&#x4E00;&#x500B; channel&#x3002;</p><p>&#x9019;&#x662F;&#x4E00;&#x500B;&#x6BD4;&#x8F03;&#x9AD8;&#x7D1A;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5F88;&#x96E3;&#x60F3;&#x51FA;&#x4E00;&#x500B;&#x7C21;&#x55AE;&#x7684;&#x7BC4;&#x4F8B;&#x4F86;&#x8B49;&#x660E;&#x9019;&#x500B;&#x884C;&#x70BA;&#x3002;&#x6211;&#x5011;&#x5728;&#x4E0B;&#x4E00;&#x7BC0;&#x7576;&#x4E2D;&#x4F86;&#x8AAA;&#x660E;&#x9019;&#x500B;&#x90E8;&#x5206;&#x3002;</p><h3 id="&#x903E;&#x6642;">&#x903E;&#x6642;</h3><p>&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x770B;&#x904E;&#x66AB;&#x5B58;&#x7684;&#x8A0A;&#x606F;&#xFF0C;&#x540C;&#x6642;&#x4E5F;&#x5B78;&#x5230;&#x5982;&#x4F55;&#x7C21;&#x55AE;&#x7684;&#x4E1F;&#x68C4;&#x4ED6;&#x5011;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x500B;&#x6BD4;&#x8F03;&#x5E38;&#x898B;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x903E;&#x6642;&#x6A5F;&#x5236;&#x3002;&#x6211;&#x5011;&#x6703;&#x963B;&#x585E;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x6C38;&#x9060;&#x963B;&#x585E;&#x3002;&#x9019;&#x5728; Go &#x7576;&#x4E2D;&#x4E5F;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x505A;&#x5230;&#x7684;&#x3002;&#x8001;&#x5BE6;&#x8AAA;&#xFF0C;&#x6211;&#x8A8D;&#x7232;&#x9019;&#x500B;&#x8A9E;&#x6CD5;&#x6709;&#x9EDE;&#x96E3;&#x4EE5;&#x63A5;&#x53D7;&#xFF0C;&#x4F46;&#x4ED6;&#x662F;&#x6BD4;&#x8F03;&#x9748;&#x6D3B;&#x548C;&#x6709;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x6211;&#x4E0D;&#x80FD;&#x4E0D;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p><p>&#x70BA;&#x4E86;&#x9054;&#x5230;&#x963B;&#x585E;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>time.After</code> &#x9019;&#x500B;&#x51FD;&#x5F0F;&#x3002;&#x8B93;&#x6211;&#x5011;&#x4F86;&#x770B;&#x770B;&#x6703;&#x767C;&#x751F;&#x4EC0;&#x9EBC;&#x795E;&#x5947;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x5011;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#x767C;&#x9001;&#x90E8;&#x5206;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">for</span> {
  <span class="hljs-keyword">select</span> {
  <span class="hljs-keyword">case</span> c &lt;- rand.Int():
  <span class="hljs-keyword">case</span> &lt;-time.After(time.Millisecond * <span class="hljs-number">100</span>):
    fmt.Println(<span class="hljs-string">&quot;timed out&quot;</span>)
  }
  time.Sleep(time.Millisecond * <span class="hljs-number">50</span>)
}</code></pre>
<p><code>time.After</code> &#x6703;&#x56DE;&#x50B3;&#x4E00;&#x500B; channel&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5C0D;&#x5B83;&#x4F7F;&#x7528; <code>select</code> &#x8A9E;&#x6CD5;&#x3002;&#x9019;&#x500B; channel &#x5728;&#x6307;&#x5B9A;&#x7684;&#x6642;&#x9593;&#x5F8C;&#x6703;&#x88AB;&#x5BEB;&#x5165;&#xFF0C;&#x5C31;&#x9019;&#x6A23;&#x3002;&#x6C92;&#x6709;&#x4EC0;&#x9EBC;&#x6BD4;&#x9019;&#x500B;&#x66F4;&#x795E;&#x5947;&#x7684;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4ECD;&#x7136;&#x89BA;&#x5F97;&#x56F0;&#x60D1;&#xFF0C;&#x9019;&#x88E1;&#x5BE6;&#x4F5C;&#x4E86;&#x4E00;&#x500B; <code>after</code>&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">func</span> after(d time.Duration) <span class="hljs-keyword">chan</span> <span class="hljs-keyword">bool</span> {
  c := <span class="hljs-built_in">make</span>(<span class="hljs-keyword">chan</span> <span class="hljs-keyword">bool</span>)
  <span class="hljs-keyword">go</span> <span class="hljs-keyword">func</span>() {
    time.Sleep(d)
    c &lt;- <span class="hljs-literal">true</span>
  }()
  <span class="hljs-keyword">return</span> c
}</code></pre>
<p>&#x56DE;&#x4F86;&#x770B;&#x6211;&#x5011;&#x7684; <code>select</code> &#x8A9E;&#x6CD5;&#xFF0C;&#x9019;&#x88E1;&#x6709;&#x5E7E;&#x500B;&#x6709;&#x8DA3;&#x7684;&#x5730;&#x65B9;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728; <code>select</code> &#x5F8C;&#x9762;&#x589E;&#x52A0; <code>default</code> &#x6703;&#x767C;&#x751F;&#x4EC0;&#x9EBC;&#x4E8B;&#x60C5;&#xFF1F;&#x4F60;&#x80FD;&#x731C;&#x731C;&#x770B;&#x55CE;&#xFF1F;&#x8A66;&#x8A66;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x78BA;&#x5B9A;&#x6703;&#x767C;&#x751F;&#x4EC0;&#x9EBC;&#x4E8B;&#x60C5;&#x3002;&#x8A18;&#x4F4F;&#xFF0C;&#x5982;&#x679C; channel &#x7121;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x6642;&#x5019;&#xFF0C;<code>default</code> &#x7684;&#x90E8;&#x5206;&#x6703;&#x88AB;&#x57F7;&#x884C;&#x3002;</p><p>&#x6B64;&#x5916;&#xFF0C;<code>time.After</code> &#x7684;&#x985E;&#x578B;&#x662F; <code>chan time.Time</code>&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x662F;&#x7C21;&#x55AE;&#x7684;&#x628A;&#x50B3;&#x7D66; channel &#x7684;&#x503C;&#x7D66;&#x4E1F;&#x6389;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x8A71;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5617;&#x8A66;&#x63A5;&#x6536;&#x5B83;&#x5011;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">case</span> t := &lt;-time.After(time.Millisecond * <span class="hljs-number">100</span>):
  fmt.Println(<span class="hljs-string">&quot;timed out at&quot;</span>, t)</code></pre>
<p>&#x6CE8;&#x610F;&#x6211;&#x5011;&#x7684; <code>select</code> &#x8A9E;&#x6CD5;&#xFF0C;&#x6CE8;&#x610F;&#x6211;&#x5011;&#x662F;&#x5F80; <code>c</code> &#x767C;&#x9001;&#x8CC7;&#x6599;&#xFF0C;&#x4F46;&#x662F;&#x662F;&#x5F9E; <code>time.After</code> &#x62FF;&#x8CC7;&#x6599;&#x3002;&#x4E0D;&#x7BA1;&#x6211;&#x5011;&#x662F;&#x5F9E; channel &#x4E2D;&#x63A5;&#x6536;&#x8CC7;&#x6599;&#x3001;&#x767C;&#x9001;&#x8CC7;&#x6599;&#xFF0C;<code>select</code> &#x7684;&#x6A5F;&#x5236;&#x90FD;&#x4E00;&#x6A23;&#xFF1A;</p><ul><li>&#x7B2C;&#x4E00;&#x500B;&#x53EF;&#x7528;&#x7684; channel &#x6703;&#x88AB;&#x9078;&#x64C7;&#x3002;
</li>
<li>&#x5982;&#x679C;&#x6709;&#x591A;&#x500B; channel &#x53EF;&#x7528;&#xFF0C;&#x6703;&#x96A8;&#x6A5F;&#x6311;&#x9078;&#x4E00;&#x500B;&#x3002;
</li>
<li>&#x5982;&#x679C;&#x6C92;&#x6709; channel &#x53EF;&#x7528;&#xFF0C;<code>default</code> &#x7684;&#x90E8;&#x5206;&#x6703;&#x88AB;&#x57F7;&#x884C;&#x3002;
</li>
<li>&#x5982;&#x679C;&#x6C92;&#x6709; <code>default</code>&#xFF0C;<code>select</code> &#x6703;&#x963B;&#x585E;&#x3002;
</li></ul>
<p>&#x6700;&#x5F8C;&#xFF0C;&#x5728; <code>for</code> &#x8FF4;&#x5708;&#x4E2D;&#x4F7F;&#x7528; <code>select</code> &#x662F;&#x5E38;&#x898B;&#x7684;&#xFF1A;</p><pre><code class="lang-go"><span class="hljs-keyword">for</span> {
  <span class="hljs-keyword">select</span> {
  <span class="hljs-keyword">case</span> data := &lt;-c:
    fmt.Printf(<span class="hljs-string">&quot;worker %d got %d\n&quot;</span>, w.id, data)
  <span class="hljs-keyword">case</span> &lt;-time.After(time.Millisecond * <span class="hljs-number">10</span>):
    fmt.Println(<span class="hljs-string">&quot;Break time&quot;</span>)
    time.Sleep(time.Second)
  }
}</code></pre>
<h2 id="&#x5728;&#x4F60;&#x7E7C;&#x7E8C;&#x5B78;&#x7FD2;&#x4E4B;&#x524D;">&#x5728;&#x4F60;&#x7E7C;&#x7E8C;&#x5B78;&#x7FD2;&#x4E4B;&#x524D;</h2><p>&#x5982;&#x679C;&#x4F60;&#x624D;&#x525B;&#x525B;&#x9032;&#x5165;&#x4E26;&#x884C;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x89BA;&#x5F97;&#x5B83;&#x662F;&#x92B3;&#x4E0D;&#x53EF;&#x64CB;&#x7684;&#x3002;&#x7684;&#x78BA;&#xFF0C;&#x4ED6;&#x9700;&#x8981;&#x4F60;&#x66F4;&#x591A;&#x7684;&#x95DC;&#x6CE8;&#xFF0C;&#x7562;&#x7ADF; Go &#x8A9E;&#x8A00;&#x7684;&#x76EE;&#x6A19;&#x5C31;&#x662F;&#x70BA;&#x4E86;&#x8B93;&#x4E26;&#x884C;&#x7A0B;&#x5F0F;&#x66F4;&#x5BB9;&#x6613;&#x64B0;&#x5BEB;&#x3002;</p><p>Goroutine &#x6709;&#x6548;&#x7684;&#x62BD;&#x8C61;&#x5316;&#x4E86;&#x4E26;&#x884C;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;Channel &#x5E6B;&#x52A9;&#x6211;&#x5011;&#x5728;&#x8CC7;&#x6599;&#x9700;&#x8981;&#x5171;&#x4EAB;&#x6642;&#x6240;&#x6703;&#x7522;&#x751F;&#x7684;&#x4E00;&#x4E9B;&#x56B4;&#x91CD;&#x7684; bug&#x3002;&#x5176;&#x5BE6;&#x4E0D;&#x50C5;&#x50C5;&#x662F;&#x6D88;&#x9664; bug&#xFF0C;&#x4ED6;&#x9084;&#x6539;&#x8B8A;&#x4E86;&#x6211;&#x5011;&#x5982;&#x4F55;&#x64B0;&#x5BEB;&#x6211;&#x5011;&#x7684;&#x4E26;&#x884C;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x958B;&#x59CB;&#x601D;&#x8003;&#x600E;&#x9EBC;&#x900F;&#x904E;&#x8A0A;&#x606F;&#x7684;&#x50B3;&#x905E;&#x4F86;&#x64B0;&#x5BEB;&#x4E26;&#x884C;&#x7A0B;&#x5F0F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x900F;&#x904E;&#x90A3;&#x4E9B;&#x5BB9;&#x6613;&#x51FA;&#x932F;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;</p><p>&#x96D6;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4F9D;&#x820A;&#x5EE3;&#x6CDB;&#x5730;&#x4F7F;&#x7528; <code>sync</code> &#x548C; <code>sync/atomic</code> &#x5957;&#x4EF6;&#x4E2D;&#x7684;&#x540C;&#x6B65;&#x6A5F;&#x5236;&#x3002;&#x6211;&#x8A8D;&#x70BA;&#x53BB;&#x719F;&#x6089;&#x4ED6;&#x5011;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x6211;&#x9F13;&#x52F5;&#x4F60;&#x5728;&#x5B78;&#x7FD2;&#x6642;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x95DC;&#x6CE8; <code>channel</code>&#xFF0C;&#x4F46;&#x7576;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x77ED;&#x66AB;&#x7684;&#x9396;&#x7684;&#x7BC4;&#x4F8B;&#x6642;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8003;&#x616E;&#x4F7F;&#x7528; mutex &#x6216;&#x8B80;&#x5BEB; mutex&#x3002;</p>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter5.html" class="navigation navigation-prev " aria-label="Previous page: 第五章 - 花絮">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="conclusion.html" class="navigation navigation-next " aria-label="Next page: 結論">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第六章 - 並行","level":"1.10","depth":1,"next":{"title":"結論","level":"1.11","depth":1,"path":"conclusion.md","ref":"./conclusion.md","articles":[]},"previous":{"title":"第五章 - 花絮","level":"1.9","depth":1,"path":"chapter5.md","ref":"./chapter5.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"github":{"url":"https://github.com/kevingo/the-little-go-book"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"The Little Go Book 繁體中文翻譯版","gitbook":"3.2.0"},"file":{"path":"chapter6.md","mtime":"2017-03-07T03:33:15.596Z","type":"markdown"},"gitbook":{"version":"3.2.0","time":"2017-03-07T03:34:24.460Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

